
{
    "patentCorpus": "USPAT",
    "patentType": "UTILITY",
    "productionDate": {
        "raw": "20161219",
        "iso": "2016-12-19T00:00:00Z"
    },
    "publishedDate": {
        "raw": "20170103",
        "iso": "2017-01-03T00:00:00Z"
    },
    "documentId": "US9532496B2",
    "documentDate": {
        "raw": "20170103",
        "iso": "2017-01-03T00:00:00Z"
    },
    "applicationId": "US14585764",
    "applicationDate": {
        "raw": "20141230",
        "iso": "2014-12-30T00:00:00Z"
    },
    "relatedIds": [
        "US14155483",
        "US14585764",
        "US14585764"
    ],
    "otherIds": [
        "US14585764"
    ],
    "agent": [
        {
            "name": {
                "type": "person",
                "raw": "Oppold, Thomas J.",
                "prefix": "",
                "firstName": "Thomas J.",
                "middleName": "",
                "lastName": "Oppold",
                "suffix": "",
                "abbreviated": "Oppold, T.",
                "synonyms": [
                ]
            },
            "address": {
                "street": "",
                "city": "",
                "state": "",
                "zipCode": "",
                "country": "UNKNOWN",
                "email": "",
                "fax": "",
                "phone": ""
            }
        }
    ],
    "applicant": [
        {
            "name": {
                "type": "org",
                "raw": "Precision Planting LLC",
                "suffix": "",
                "synonyms": [
                ]
            },
            "address": {
                "street": "",
                "city": "Tremont",
                "state": "IL",
                "zipCode": "",
                "country": "US",
                "email": "",
                "fax": "",
                "phone": ""
            }
        }
    ],
    "inventors": [
        {
            "sequence": "",
            "name": {
                "type": "person",
                "raw": "Sauder, Derek A.",
                "prefix": "",
                "firstName": "Derek A.",
                "middleName": "",
                "lastName": "Sauder",
                "suffix": "",
                "abbreviated": "Sauder, D.",
                "synonyms": [
                ]
            },
            "address": {
                "street": "",
                "city": "Tremont",
                "state": "IL",
                "zipCode": "",
                "country": "US",
                "email": "",
                "fax": "",
                "phone": ""
            },
            "residency": "",
            "nationality": ""
        },
        {
            "sequence": "",
            "name": {
                "type": "person",
                "raw": "Hodel, Jeremy J.",
                "prefix": "",
                "firstName": "Jeremy J.",
                "middleName": "",
                "lastName": "Hodel",
                "suffix": "",
                "abbreviated": "Hodel, J.",
                "synonyms": [
                ]
            },
            "address": {
                "street": "",
                "city": "Morton",
                "state": "IL",
                "zipCode": "",
                "country": "US",
                "email": "",
                "fax": "",
                "phone": ""
            },
            "residency": "",
            "nationality": ""
        }
    ],
    "assignees": [
        {
            "name": {
                "type": "org",
                "raw": "Precision Planting LLC",
                "suffix": "",
                "synonyms": [
                ]
            },
            "address": {
                "street": "",
                "city": "Tremont",
                "state": "IL",
                "zipCode": "",
                "country": "US",
                "email": "",
                "fax": "",
                "phone": ""
            },
            "role": "02",
            "roleDefinition": "U.S. company or corporation"
        }
    ],
    "examiners": [
        {
            "name": "Novosad, Christopher J",
            "type": "PRIMARY",
            "department": "3671"
        }
    ],
    "title": "Dynamic Supplemental Downforce Control System for Planter Row Units",
    "abstract": {
        "raw": "<abstract id=\"abstract\">\n<p id=\"p-0001\" num=\"0000\">A dynamic supplemental downforce control system for a planter row unit. The system includes closed-loop feedback circuit that cooperates with a downforce actuator to dynamically control fluid flow to the downforce actuator to maintain balance between the actual gauge wheel downforce and a desired gauge wheel downforce during planting operations.</p>\n</abstract>",
        "normalized": "\n<p id=\"p-0001\" num=\"0000\" level=\"\">A dynamic supplemental downforce control system for a planter row unit. The system includes closed-loop feedback circuit that cooperates with a downforce actuator to dynamically control fluid flow to the downforce actuator to maintain balance between the actual gauge wheel downforce and a desired gauge wheel downforce during planting operations.</p>\n",
        "plain": "\nA dynamic supplemental downforce control system for a planter row unit. The system includes closed-loop feedback circuit that cooperates with a downforce actuator to dynamically control fluid flow to the downforce actuator to maintain balance between the actual gauge wheel downforce and a desired gauge wheel downforce during planting operations.\n"
    },
    "description": {
        "full_raw": "\n<heading id=\"h-0001\" level=\"1\">BACKGROUND</heading>\n<p id=\"p-0002\" num=\"0001\">It is recognized that sufficient downforce must be exerted on a planter row unit to ensure the desired furrow depth and soil compaction is achieved. If excessive downforce is applied, especially in soft or moist soils, the soil may be overly compacted which can affect the ability of germinating seeds to break through the soil. If insufficient downforce is applied, particularly in hard or dry soil, the planter may ride up and out of the soil resulting in insufficient depth of the furrow.</p>\n<p id=\"p-0003\" num=\"0002\">In the past, coiled springs extending between the parallel arms of the row units of the planter (see <figref idref=\"DRAWINGS\">FIG. 1</figref>) were often employed to provide the additional or “supplemental” downforce needed to ensure the desired furrow depth and soil compaction was achieved. By positioning the spring at various preset locations along the parallel arms, the amount of downforce exerted on the row unit could be increased or decreased. However, the amount of supplemental downforce exerted by the spring remained constant until the spring was repositioned. For example, when the planter encountered hard or dry soil such that greater supplemental downforce is necessary to maintain furrow depth or the desired soil compaction, the operator had to stop and adjust the location of the spring in order to increase the supplemental downforce. Furthermore, during operation, as the seed or fertilizer in the hoppers was dispensed, the weight of the row unit gradually decreased causing a corresponding reduction in the total downforce on the gauge wheels, because the supplemental downforce exerted by the spring remained substantially constant until the spring was manually repositioned.</p>\n<p id=\"p-0004\" num=\"0003\">More advanced supplemental downforce systems, such as disclosed in U.S. application Ser. No. 12/679,710 (Pub. No. US2010/0198529) by Sauder et al. (hereinafter “the Sauder '710 Application”), which is incorporated herein in its entirety by reference, measure the strain in a member of the gauge wheel adjusting mechanism to determine the force being exerted against the gauge wheels to determine the downforce. A central processor or controller actuates the hydraulic or pneumatic cylinders, airbags or other actuators to increase or decrease the supplemental downforce across all the row units. While such systems may serve their intended purpose, they can be more costly because they require central processing circuitry as well as hydraulic or pneumatic valves, load sensors, and associated cable harnesses at each row unit in order to properly maintain the desired downforce. Moreover, the required processing steps increase the response time of such a system as compared with the use of coil springs or other earlier mechanical systems for supplying supplemental downforce. In addition, central control systems that apply a common supplemental downforce to each row unit fail to respond to unique loads experienced by each row unit, such that insufficient or excessive supplemental downforce may be applied to any given row unit.</p>\n<p id=\"p-0005\" num=\"0004\">Thus, there is a need for a supplemental downforce control system that maintains a desired downforce at each row unit and additionally allows an operator to set the desired downforce from the tractor cab while on-the-go during planting operations.</p>\n\n\n<description-of-drawings>\n<heading id=\"h-0002\" level=\"1\">DESCRIPTION OF THE DRAWINGS</heading>\n<p id=\"p-0006\" num=\"0005\"><figref idref=\"DRAWINGS\">FIG. 1</figref> is a side elevation view of a conventional planter row unit showing the use of a prior art coil spring to provide supplemental downforce.</p>\n<p id=\"p-0007\" num=\"0006\"><figref idref=\"DRAWINGS\">FIG. 2</figref> is a schematic view of another conventional planter row unit showing the use of a prior art coil spring to provide supplemental downforce.</p>\n<p id=\"p-0008\" num=\"0007\"><figref idref=\"DRAWINGS\">FIG. 3</figref> is a side elevation view of the conventional planter row unit of <figref idref=\"DRAWINGS\">FIG. 1</figref> with an embodiment of a dynamic supplemental downforce control system.</p>\n<p id=\"p-0009\" num=\"0008\"><figref idref=\"DRAWINGS\">FIG. 4</figref> is a side elevation view of the conventional planter row unit of <figref idref=\"DRAWINGS\">FIG. 2</figref> with another embodiment of a dynamic supplemental downforce control system.</p>\n<p id=\"p-0010\" num=\"0009\"><figref idref=\"DRAWINGS\">FIG. 5</figref> is a schematic illustration of an embodiment of closed-loop feedback circuit for the dynamic supplemental downforce control system of <figref idref=\"DRAWINGS\">FIGS. 3 and 4</figref>.</p>\n<p id=\"p-0011\" num=\"0010\"><figref idref=\"DRAWINGS\">FIG. 6</figref> is a schematic view of an embodiment of the direction control valve for the supplemental downforce control systems of <figref idref=\"DRAWINGS\">FIGS. 3 and 4</figref>.</p>\n<p id=\"p-0012\" num=\"0011\"><figref idref=\"DRAWINGS\">FIGS. 7A-7C</figref> illustrate fluid flow and operation of the direction control valve and downforce actuator of <figref idref=\"DRAWINGS\">FIGS. 3 and 4</figref> utilizing fluid pressure from a pilot pressure control valve to impart the desired gauge wheel downforce Fd.</p>\n<p id=\"p-0013\" num=\"0012\"><figref idref=\"DRAWINGS\">FIGS. 8A-8C</figref> illustrate fluid flow and operation of the direction control valve and downforce actuator of <figref idref=\"DRAWINGS\">FIGS. 3 and 4</figref> utilizing a solenoid to impart the desired gauge wheel downforce Fd.</p>\n<p id=\"p-0014\" num=\"0013\"><figref idref=\"DRAWINGS\">FIG. 9</figref> is a schematic illustration of a portion of another embodiment of the closed-loop feedback circuit of <figref idref=\"DRAWINGS\">FIG. 5</figref> but with the pilot pressure control valve replaced with a manually operated pressure regulating valve.</p>\n<p id=\"p-0015\" num=\"0014\"><figref idref=\"DRAWINGS\">FIG. 10</figref> is a partial side elevation view of another embodiment of the dynamic supplemental downforce control system of <figref idref=\"DRAWINGS\">FIG. 4</figref> illustrating a piezoelectric load cell.</p>\n</description-of-drawings>\n\n\n<heading id=\"h-0003\" level=\"1\">DESCRIPTION</heading>\n<p id=\"p-0016\" num=\"0015\">Referring now to the drawings, wherein like reference numerals designate identical or corresponding parts throughout the several views, <figref idref=\"DRAWINGS\">FIG. 1</figref> illustrates a side elevation view of a single row unit <b>10</b> of a conventional row crop planter such as the type disclosed in U.S. Pat. No. 4,009,668, incorporated herein in its entirety by reference. As is well known in the art, the row units <b>10</b> are mounted in spaced relation along the length of a transverse toolbar <b>12</b> by a parallel linkage <b>14</b>, comprised of upper and lower parallel arms <b>16</b>, <b>18</b> pivotally mounted at a forward end to the transverse toolbar <b>12</b> and at their rearward end to the row unit frame <b>20</b>. The parallel linkage <b>14</b> permits each row unit <b>10</b> to move vertically independently of the toolbar <b>12</b> and independently of the other spaced row units in order to accommodate changes in terrain or upon the row unit encountering a rock or other obstruction as the planter is drawn through the field.</p>\n<p id=\"p-0017\" num=\"0016\">The row unit frame <b>20</b> operably supports a seed hopper <b>22</b>, and a smaller hopper <b>24</b> for insecticide and/or fertilizer, a seed meter <b>26</b> and a seed tube <b>28</b> as well as a furrow opener assembly <b>30</b> and furrow closing assembly <b>40</b>. The furrow opening assembly <b>30</b> comprises a pair of furrow opener discs <b>32</b> and a pair of gauge wheels <b>34</b>. The gauge wheels <b>34</b> are pivotally secured to the row unit frame <b>20</b> by gauge wheel arms <b>36</b>. A furrow depth adjusting member <b>38</b> adjustably positions the gauge wheels <b>34</b> relative to the furrow opener discs <b>32</b> for establishing the desired furrow depth. A coil spring <b>50</b> is disposed between the parallel arms <b>16</b>, <b>18</b> to provide supplemental downforce to ensure that the furrow opener discs <b>32</b> fully penetrate the soil to the desired depth as set by the depth adjusting member <b>38</b> and to provide soil compaction for proper furrow formation. Rather than a coil spring, supplemental downforce may be provided by actuators or other suitable means such as disclosed in U.S. Pat. No. 6,389,999 to Duello, U.S. Pat. No. 6,701,857 to Jensen, in European Patent No. EP0372901 to Baker, and/or the Sauder '710 Application.</p>\n<p id=\"p-0018\" num=\"0017\">In operation, as the row unit <b>10</b> is lowered to the planting position, the opener discs <b>32</b> penetrate into the soil. At the same time, the soil forces the gauge wheels <b>34</b> to pivot upwardly until the gauge wheel arms <b>36</b> abut or come into contact with the stop position previously set with furrow depth adjusting member <b>38</b> or until a static load balance is achieved between the vertical load of the row unit and the reaction of the soil. As the planter is drawn forwardly in the direction indicated by arrow <b>39</b>, the furrow opener discs cut a V-shaped furrow <b>60</b> into the soil while the gauge wheels <b>34</b> compact the soil to aid in formation of the V-shaped furrow. Individual seeds <b>62</b> from the seed hopper <b>22</b> are dispensed by the seed meter <b>26</b> into the seed tube <b>28</b> in uniformly spaced increments. The seed tube <b>28</b> directs the individual dispensed seeds <b>62</b> downwardly and rearwardly between the furrow opener discs <b>32</b> and into the bottom of the V-shaped furrow <b>60</b>. The furrow <b>60</b> is then covered with soil and lightly compacted by the furrow closing assembly <b>40</b>.</p>\n<p id=\"p-0019\" num=\"0018\"><figref idref=\"DRAWINGS\">FIG. 2</figref> illustrates a side view of another embodiment of a conventional row unit <b>10</b> for a central-fill planter such as disclosed in U.S. Pat. No. 7,438,006, incorporated herein in its entirety by reference. As in the row unit embodiment of <figref idref=\"DRAWINGS\">FIG. 1</figref>, the row unit embodiment of <figref idref=\"DRAWINGS\">FIG. 2</figref> includes a parallel arm linkage <b>14</b> comprised of upper and lower parallel arms <b>16</b>, <b>18</b> pivotally mounted at a forward end to the transverse toolbar <b>12</b> and at their rearward end to the row unit frame <b>20</b>. The row unit frame <b>20</b> supports a mini seed hopper <b>23</b>, seed meter <b>26</b>, a seed tube <b>28</b>, as well as the furrow opener assembly <b>30</b>, comprising a furrow opener discs <b>32</b> and gauge wheels <b>34</b>. The gauge wheels <b>34</b> are pivotally secured to the row unit frame <b>20</b> by gauge wheel arms <b>36</b>. Unlike the embodiment of <figref idref=\"DRAWINGS\">FIG. 1</figref>, the gauge wheel arms <b>36</b> in the embodiment of <figref idref=\"DRAWINGS\">FIG. 2</figref> extend forwardly of the gauge wheels <b>34</b>.</p>\n<p id=\"p-0020\" num=\"0019\">The row units <b>10</b> in <figref idref=\"DRAWINGS\">FIGS. 3 and 4</figref> are substantially the same as the row units <b>10</b> depicted in <figref idref=\"DRAWINGS\">FIGS. 1 and 2</figref>, respectively, except that in <figref idref=\"DRAWINGS\">FIGS. 3 and 4</figref>, the coil springs <b>50</b> have been removed and replaced with an embodiment of a dynamic supplemental downforce control system <b>100</b> in accordance with the present invention.</p>\n<p id=\"p-0021\" num=\"0020\"><figref idref=\"DRAWINGS\">FIG. 5</figref> schematically illustrates a preferred embodiment of the automated supplemental downforce control system <b>100</b> which comprises a closed-loop feedback circuit <b>110</b> that cooperates with a downforce actuator <b>200</b>. Preferably, the dynamic system <b>100</b> utilizes the hydraulic system of the tractor pulling the planter and therefore preferably comprises an electro-hydraulic closed-loop feedback circuit <b>110</b> and a dual action hydraulic cylinder <b>200</b>. However, the dynamic system <b>100</b> may be equally adapted for use with pneumatic actuators in cooperation with any corresponding electro-pneumatic closed-loop feedback circuit. It should also be appreciated that although the schematic illustration of <figref idref=\"DRAWINGS\">FIG. 5</figref> shows the dynamic system <b>100</b> in relation to a four-row planters, the dynamic system <b>100</b> can be adapted to a planter with any number of row units.</p>\n<p id=\"p-0022\" num=\"0021\">As used herein, the term “actual gauge wheel downforce” Fa (<figref idref=\"DRAWINGS\">FIGS. 3 and 4</figref>) refers to the dead load, live load and supplemental downforce transferred to the soil through the gauge wheels <b>34</b> of the row unit <b>10</b>. The row unit dead load is understood to be the mass of the entire row unit and any accessories mounted thereon. Therefore, the row unit dead load remains substantially constant and would include the mass of the row unit frame <b>20</b>, the furrow opening assembly <b>30</b>, the furrow closing assembly <b>40</b>, the hoppers <b>22</b>, <b>24</b>, seed meter <b>26</b>, seed tube <b>28</b> and the mass of any other attachments or devices operably supported or carried by the row unit frame. The row unit live load is understood to be the mass of the seed, insecticide and/or fertilizer within the hoppers <b>22</b>, <b>24</b>, <b>23</b> of the row unit or otherwise carried by the row unit. The live load typically varies as the material is dispensed during planting operations.</p>\n<p id=\"p-0023\" num=\"0022\">The term “supplemental downforce,” as used herein refers to the loading, other than the live load and dead load, that is applied to the row unit to force the row unit downwardly or upwardly relative to the toolbar <b>12</b> to achieve the desired furrow depth and soil compaction under the gauge wheels <b>34</b>. It should be understood that the supplemental downforce may increase or decrease the actual gauge wheel downforce Fa. It is recognized that a certain amount of the row unit dead load, live load and supplemental downforce is carried by the furrow opener discs <b>32</b> and the furrow closing assembly <b>40</b>. Nevertheless, because the preferred system and method <b>100</b> disclosed herein preferably involves only the forces or loads exerted on or transferred by the gauge wheels, then loads transferred by the opener discs and closing wheel need not be considered.</p>\n<p id=\"p-0024\" num=\"0023\">Referring to <figref idref=\"DRAWINGS\">FIGS. 3 and 4</figref>, it should be appreciated that if the downforce actuator <b>200</b> is extended, the row unit <b>10</b> will be forced downwardly relative to toolbar <b>12</b>, resulting in an increase in the supplemental downforce and a corresponding increase in the actual gauge wheel downforce Fa. Likewise, if the downforce actuator <b>200</b> is retracted, the row unit <b>10</b> will be pulled upwardly relative to the toolbar <b>12</b>, resulting in a decrease in the supplemental downforce and a corresponding reduction in the actual gauge wheel downforce Fa.</p>\n<p id=\"p-0025\" num=\"0024\">Referring to <figref idref=\"DRAWINGS\">FIG. 5</figref>, the preferred electro-hydraulic closed-loop feedback circuit <b>110</b> comprises a control module <b>112</b>, a pilot pressure control valve <b>114</b>, one load sensor <b>116</b> (preferably one per row unit), at least one direction control valve <b>140</b> (preferably one per row unit), fluid lines <b>122</b> and signal lines <b>124</b>. As described in greater detail later, a lever <b>136</b> (<figref idref=\"DRAWINGS\">FIGS. 3 and 4</figref>) is preferably disposed to transmit the up and down directional displacement of the gauge wheels and thus the corresponding actual gauge wheel downforce Fa, to the direction control valve <b>140</b>. The signal lines <b>124</b> communicate electrical signals between the control module <b>112</b>, the load sensor <b>116</b>, the pilot pressure valve <b>114</b>, and the direction control valve <b>140</b>. The fluid lines communicate hydraulic fluid between a fluid source <b>130</b>, the pilot pressure control valve <b>114</b>, the direction control valve <b>140</b> and the downforce actuator <b>200</b>. The fluid source <b>130</b> is preferably the hydraulic fluid reservoir of the tractor pulling the planter. It should be appreciated that if the dynamic system <b>100</b> is an electro-pneumatic system, the fluid source may be an air compressor, compressed air tank or other suitable air source.</p>\n<p id=\"p-0026\" num=\"0025\">In general, through the control module <b>112</b>, the operator is able to set the desired gauge wheel downforce Fd, which, in one embodiment, corresponds to the output pressure of the pilot pressure control valve <b>114</b>. The control module <b>112</b> also preferably permits the operator to view the actual gauge wheel downforce Fa of the row units <b>10</b> as detected by the load sensors <b>116</b>. The direction control valve <b>140</b> permits fluid flow to and from the individual downforce actuators <b>200</b> in response to any imbalance between the desired gauge wheel downforce Fd acting at one end of the direction control valves <b>140</b> against the actual gauge wheel downforce Fa acting at the other end of the direction control valves <b>140</b>. Thus, the dynamic system <b>100</b> independently and dynamically adjusts the supplemental downforce for each individual row unit as each row unit experiences unique loading conditions during planting operations. The downforce adjustment occurs without the need for complex and expensive central processing circuitry or software programming that would otherwise be required to simultaneously monitor and compare the desired gauge wheel downforce Fd with the actual gauge wheel downforce Fa across all row units and to then send signals to independently control the downforce actuators <b>200</b> at each row unit.</p>\n<p id=\"p-0027\" num=\"0026\">Although it is preferable for each row unit <b>10</b> to have separate load sensor <b>116</b> so the operator can monitor the actual gauge wheel downforce for each row, it may be desirable to have load sensors on only certain row units, such as on the outside row units and one or two inner row units. It should also be appreciated that although it is desirable for each row unit <b>10</b> to have a direction control valve <b>140</b>, a single direction control valve <b>140</b> may be used to control fluid flow to the downforce actuators <b>200</b> of multiple row units. Similarly a single downforce actuator <b>200</b> may be utilized to control the supplemental downforce across multiple row units.</p>\n<p id=\"p-0028\" num=\"0027\">The pilot pressure control valve <b>114</b> is in fluid communication with the fluid source <b>130</b> via fluid lines <b>122</b><i>a </i>and the direction control valve <b>140</b> via fluid lines <b>122</b><i>b</i>. It is also in electrical communication with the control module <b>112</b> via signal lines <b>124</b><i>a</i>. The operator is able to set the desired output pressure of the pilot pressure control valve <b>114</b> via the control module <b>112</b>. Suitable pilot pressure control valves include solenoid-operated proportional valves such as model no. PV72-21 distributed by HydraForce, Inc. in Lincolnshire, Ill.</p>\n<p id=\"p-0029\" num=\"0028\">The load sensor <b>116</b> is disposed to preferably generate an electrical signal corresponding to the actual gauge wheel downforce Fa (<figref idref=\"DRAWINGS\">FIGS. 3-5</figref>). The control module <b>112</b> receives the generated signal from the load sensor <b>116</b> via the signal lines <b>124</b><i>b </i>and preferably displays to the operator the actual gauge wheel downforce Fa corresponding to the generated signal. In a preferred embodiment, the load sensor <b>116</b> is a strain gauge such as a Wheatstone bridge circuit mounted in any suitable location from which the actual gauge wheel downforce Fa can be reasonably accurately determined. For example, the load sensor <b>116</b> may be mounted to detect the strain in the gauge wheel arm <b>36</b> (<figref idref=\"DRAWINGS\">FIGS. 4 and 5</figref>) such as disclosed in U.S. Pat. No. 6,389,999 to Duello, or U.S. Pat. No. 6,701,857 to Jensen, or the strain in the pivot pin of the depth adjusting member <b>38</b> (<figref idref=\"DRAWINGS\">FIG. 3</figref>), such as disclosed in the Sauder '253 Application, or in the equalizer for the depth adjusting member as disclosed in U.S. Provisional Application No. 60/883,957 filed Jan. 8, 2008 by Sauder et al., or in a location such as disclosed in European Patent No. EP0372901 to Baker. All of the above-referenced patents and/or patent applications are incorporated herein in their entireties by reference.</p>\n<p id=\"p-0030\" num=\"0029\">The control module <b>112</b> is preferably integrated into an existing planter monitor that provides a user interface, such as a touch screen, keypad or other input means, through which the operator can select or input the desired gauge wheel downforce Fd. The control module <b>112</b> is also preferably integrated into an existing planter monitor that provides a display screen or other visual display through which the operator can view and monitor the actual gauge wheel downforce Fa of the row units. In a preferred embodiment, the control module <b>112</b> is integrated into the 20/20® planter monitor system sold by Precision Planting, Inc., of Tremont, Ill. and as disclosed in U.S. patent application Ser. No. 12/522,252 (Pub. No. US2010/0010667) by Sauder et al., incorporated herein in its entirety by reference. Those skilled in the art would readily understand how to modify the 20/20® planter monitor or any other planter monitor to integrate the additional programming and circuitry necessary to allow an operator to input a desired gauge wheel downforce Fd for controlling the output of the pilot pressure valve <b>114</b> and to also receive and display the actual gauge wheel downforce Fa as detected by the load sensor <b>116</b>. Alternatively, as would be recognized by those skilled in the art, the control module <b>112</b> may be a standalone system incorporating the necessary circuitry for controlling the output pressure of the pilot control valve <b>114</b> corresponding to the desired gauge wheel downforce Fd, and/or for displaying the actual gauge wheel downforce Fa of the row units. Regardless of whether the control module <b>112</b> is integrated into an existing planter monitor system or as a standalone unit, it is preferably mounted in the cab of the tractor in a location where an operator can view and interact with the user interface during planting operations.</p>\n<p id=\"p-0031\" num=\"0030\">Referring to <figref idref=\"DRAWINGS\">FIGS. 6 and 7A-7C</figref>, the direction control valve <b>140</b> is preferably a three-position directional control valve similar such as model no. PTS16-12 distributed by Eaton Corporation, Eden Prairie, Minn. The direction control valve <b>140</b> preferably includes a housing <b>142</b> having an axial through-bore <b>144</b> and an enlarged counterbore <b>146</b>. A series of ports extend transversely through the sidewall <b>148</b> of the housing <b>142</b> and into the axial through-bore <b>144</b>, preferably including an inlet port <b>150</b>, first and second fluid return ports <b>152</b>, <b>154</b>, and first and second actuator ports <b>156</b>, <b>158</b>. A spool <b>160</b> is slidably disposed within the housing <b>142</b>. The spool <b>160</b> has a shaft <b>162</b> and an enlarged head <b>164</b>. The enlarged head <b>164</b> is disposed within the counterbore <b>146</b>. A spring <b>166</b> biases the spool head <b>164</b> leftward as viewed in <figref idref=\"DRAWINGS\">FIG. 6</figref>. The shaft <b>162</b> includes two longitudinally spaced circumferential rings <b>168</b>. The circumferential rings <b>168</b> define raised surfaces, which, when aligned with the first and second actuator ports <b>156</b>, <b>158</b> as shown in <figref idref=\"DRAWINGS\">FIG. 6</figref> effectively block the flow of fluid into or out of the ports and prevent passage of fluid from one side of the circumferential ring to the other. Thus, as illustrated in <figref idref=\"DRAWINGS\">FIGS. 7A-7C</figref>, the movement of the spool <b>160</b> within the through-bore <b>144</b> functions as a three position valve. The direction control valve <b>140</b> further includes a head cap <b>170</b> and an end cap <b>172</b>. The head cap <b>170</b> includes an axial end port <b>174</b> in fluid communication with an axial counterbore <b>176</b>. A block <b>178</b> is slidably disposed within the axial counterbore <b>176</b> and abuts the spring biased spool head <b>164</b>. The end cap <b>172</b> has an axial bore <b>180</b> through which the distal end of the spool shaft <b>162</b> extends. O-rings <b>182</b> are provided to fluidly seal the head cap <b>170</b> and end cap <b>172</b> with the housing <b>142</b>.</p>\n<p id=\"p-0032\" num=\"0031\">In operation, referring to <figref idref=\"DRAWINGS\">FIGS. 5, 6 and 7A-7C</figref>, fluid lines <b>122</b><i>b </i>communicate fluid from the pilot pressure valve <b>114</b> to the axial end port <b>174</b> of the direction control valves <b>140</b> at a pressure corresponding to the desired gauge wheel downforce Fd. Another set of fluid lines <b>122</b><i>c </i>communicate pressurized fluid from the fluid pressure source <b>130</b> to the inlet port <b>150</b> of each direction control valve <b>140</b>. Another set of fluid lines <b>122</b><i>d </i>communicate fluid between the fluid return ports <b>152</b>, <b>154</b> back to the fluid source <b>130</b>. Another set of fluid lines <b>122</b><i>e </i>communicate fluid between the first and second actuator ports <b>156</b>, <b>158</b> to each side of the piston <b>202</b> within the downforce actuator <b>200</b> of each row unit <b>10</b>. The lever <b>136</b> (<figref idref=\"DRAWINGS\">FIGS. 3 and 4</figref>) transmits the opposing actual gauge wheel downforce Fa to the distal end of the spool shaft <b>162</b> of the direction control valve <b>140</b>.</p>\n<p id=\"p-0033\" num=\"0032\">As depicted in <figref idref=\"DRAWINGS\">FIG. 7A</figref>, if the desired gauge wheel downforce Fd is the same as the actual gauge wheel downforce Fa transmitted by the lever <b>136</b> (i.e., Fd=Fa), the circumferential rings <b>168</b> on the spool shaft <b>162</b> are preferably aligned with the first and second actuator ports <b>156</b>, <b>158</b> thereby preventing fluid flow to and from the downforce actuator <b>200</b>.</p>\n<p id=\"p-0034\" num=\"0033\">As depicted in <figref idref=\"DRAWINGS\">FIG. 7B</figref>, if the desired gauge wheel downforce Fd is greater than the actual gauge wheel downforce Fa transmitted by the lever <b>136</b> (i.e., Fd&gt;Fa), the spool shaft <b>162</b> will be forced to the right opening fluid communication between the fluid inlet port <b>150</b> and the second actuator port <b>158</b> and opening fluid communication between the first actuator port <b>156</b> and the first fluid return port <b>152</b> thereby allowing fluid to flow into the piston end of the downforce actuator <b>200</b> and out through the rod end of the downforce actuator <b>200</b> forcing the piston <b>202</b> downwardly thereby increasing the actual gauge wheel downforce Fa. When the actual gauge wheel downforce Fa is sufficiently increased to rebalance with the desired gauge wheel downforce Fd, the spool shaft <b>162</b> will return to the position as show in <figref idref=\"DRAWINGS\">FIG. 7A</figref>.</p>\n<p id=\"p-0035\" num=\"0034\">As depicted in <figref idref=\"DRAWINGS\">FIG. 7C</figref>, if the desired gauge wheel downforce Fd is less than the actual gauge wheel downforce Fa transmitted by the lever <b>136</b> (i.e., Fd&lt;Fa), the spool shaft <b>162</b> will be forced to the left opening fluid communication between the fluid inlet port <b>150</b> and the first actuator port <b>156</b> and opening fluid communication between the second actuator port <b>158</b> and the second fluid return port <b>154</b> thereby allowing fluid to flow into the rod end of the downforce actuator <b>200</b> and out through the piston end of the downforce actuator <b>200</b> forcing the piston <b>202</b> upwardly thereby decreasing the actual gauge wheel downforce Fa. When the actual gauge wheel downforce Fa is sufficiently decreased to rebalance with the desired gauge wheel downforce Fd, the spool shaft <b>162</b> will return to the position as shown in <figref idref=\"DRAWINGS\">FIG. 7A</figref>.</p>\n<p id=\"p-0036\" num=\"0035\">It should be understood that instead of a system that utilizes a pilot pressure control valve <b>114</b> to transmit the desired gauge wheel downforce Fd to the direction control valve <b>140</b>, any suitable electrical or electro-mechanical device may be used to transmit the desired gauge wheel downforce Fd to the direction control valve <b>140</b>. For example, as illustrated in <figref idref=\"DRAWINGS\">FIGS. 8A-8C</figref>, a solenoid <b>400</b> may be employed to transmit the desired gauge wheel downforce Fd against spool head <b>164</b>. In such an embodiment, the control module <b>112</b> would send an electrical signal to the solenoid <b>400</b> to cause the solenoid plunger <b>402</b> to be displaced corresponding to the desired gauge wheel downforce Fd which in turn acts upon the spool head <b>164</b> causing the corresponding displacement of the spool <b>160</b> to open and close the ports as described and illustrated in connection with <figref idref=\"DRAWINGS\">FIGS. 7A-7B</figref>.</p>\n<p id=\"p-0037\" num=\"0036\">It should also be understood that the term “direction control valve” <b>140</b> should not be construed as being limited to the embodiment described and illustrated herein, but should instead be understood to include any device or combination of devices that allows fluid flow to and/or from the downforce actuator <b>200</b> when the actual gauge wheel downforce Fa becomes imbalanced with the desired gauge wheel downforce Fd.</p>\n<p id=\"p-0038\" num=\"0037\">Because the gauge wheels <b>34</b> may occasionally encounter rocks or other obstructions during planting operations that may cause high impact forces, the direction control valve <b>140</b> is preferably mounted in a manner to avoid damage from the impact forces. For example, the direction control valve <b>140</b> is preferably bias mounted to allow the control valve <b>140</b> to displace longitudinally if an abrupt force imposed by the lever <b>136</b> on the spool <b>160</b> causes the spool head <b>164</b> to bottom out against the head cap <b>170</b>. When the abrupt force is removed, the bias mount returns the direction control valve <b>140</b> to its normal position.</p>\n<p id=\"p-0039\" num=\"0038\">In a preferred embodiment, the control module <b>112</b> cooperates with a Global Positioning System (GPS) and is configured to access a desired downforce prescription map for setting and/or modifying the desired gauge wheel downforce Fd as the planter traverses the field. The downforce prescription map may be based upon soil types, elevations, or location-specific preferences set by the operator prior to operation. In such an embodiment, the control module <b>112</b> may be used to specify a different desired gauge wheel downforce Fd to each row unit or groups of row units to more accurately follow the downforce prescription map. For example, if the locations of the far right row unit and the far left row unit on the planter correspond to different prescribed desired gauge wheel downforces Fd based on soil type or other predefined factor, the control module <b>12</b> is preferably capable of setting the appropriate desired gauge wheel downforce Fd for each of the row units.</p>\n<p id=\"p-0040\" num=\"0039\">In addition, the control module <b>112</b> is preferably configured to determine and display a ground contact percentage as disclosed in applicant's co-pending international patent application no. PCT/US2008/050427 (Pub. No. WO2009/042238), which is incorporated herein in its entirety by reference. The control module <b>112</b> is preferably configured to allow the operator to select a desired minimum ground contact percentage in addition to, or rather than, inputting a specific desired gauge wheel downforce Fd. In such an embodiment, the desired gauge wheel downforce Fd would be the desired minimum ground contact percentage. The dynamic system <b>100</b> would adjust the supplemental downforce until the actual gauge wheel downforce Fa in relation to the desired gauge wheel downforce Fd resulted in the desired minimum ground contact percentage over the sampling period. Thus, as used herein, the term “desired gauge wheel downforce Fd” should be understood to include a force that may be expressed as a numerical value or as a percentage of ground contact.</p>\n<p id=\"p-0041\" num=\"0040\">The closed-loop feedback circuit <b>110</b> preferably cooperates with a transport position detector <b>300</b> (<figref idref=\"DRAWINGS\">FIG. 5</figref>), such as a height sensor or contact switch disposed on the frame of the planter, to detect when the planter is raised into a transport position. It should be appreciated that when the planter is raised, the gauge wheel arms <b>36</b> will pivot downwardly resulting in the load sensor <b>116</b> to sense zero or near zero actual gauge wheel downforce Fa, which in turn will result in fluid flow to the downforce actuator <b>200</b> until it is fully extended. To prevent such a result from occurring, the transport position detector <b>300</b> is preferably in electrical communication with a valve <b>310</b> disposed along the fluid supply line <b>122</b><i>c</i>. When the detector <b>300</b> detects that the planter is in a transport position, the valve <b>310</b> is closed to prevent the flow of fluid from the fluid source <b>130</b> to the fluid inlet ports <b>150</b> of the direction control valves <b>140</b> of the row units <b>10</b>. The valve <b>310</b> is preferably a two-position normally open solenoid valve.</p>\n<p id=\"p-0042\" num=\"0041\">Alternatively, instead of a separate valve <b>310</b> disposed in the fluid supply line <b>122</b><i>c</i>, the transport position detector <b>300</b> may be in electrical communication with the pilot pressure control valve <b>114</b> such that when the planter is raised into the transport position, the transport position detector <b>300</b> sends a signal to cause the pilot pressure control valve <b>114</b> to close. In such an event the downforce actuators <b>200</b> will automatically “raise” in an effort to rebalance the load between Fd and Fa, by allowing fluid to flow through the direction control valve <b>140</b> as indicated in <figref idref=\"DRAWINGS\">FIG. 7C or 8C</figref>, because Fd will be zero when the pilot pressure control valve <b>114</b> is closed. When the load sensor <b>116</b> senses zero when the gauge wheels are raised above the soil such that Fd=Fa, the direction control valve <b>140</b> will return to the position illustrated in <figref idref=\"DRAWINGS\">FIG. 7A or 8A</figref> preventing fluid flow to the downforce actuator <b>200</b>.</p>\n<p id=\"p-0043\" num=\"0042\">Furthermore, it should be understood that the pilot pressure control valve <b>114</b> and the control module <b>112</b> may be combined into a single manually operated pressure regulating valve. In such an embodiment, the manually operated pressure regulating valve would preferably include labels or markers relating each pressure setting to the gauge wheel reaction force. In the same embodiment, the output pilot pressures corresponding to the desired gauge wheel downforce Fd would also be set manually. Such an embodiment is shown in <figref idref=\"DRAWINGS\">FIG. 9</figref>, which illustrates a portion of the closed-loop feedback circuit <b>110</b> wherein control module <b>112</b> and the pilot pressure valve <b>114</b> are replaced by a manually operated pressure regulating valve <b>400</b>. The valve <b>400</b> includes a controller <b>402</b> such as a dial or knob, and settings <b>404</b> corresponding to the desired gauge wheel downforce Fd, which may be indicated in pounds force as illustrated or in any other desired units.</p>\n<p id=\"p-0044\" num=\"0043\">In another embodiment, the load sensor <b>116</b> may include a piezoelectric load cell such as a compression load cell model no. FSH00402 available from Futek in Irvine, Calif., which may be disposed between the direction control valve <b>140</b> and the lever <b>136</b>. Such an embodiment is illustrated in <figref idref=\"DRAWINGS\">FIG. 10</figref>, in which a load cell <b>116</b> is mounted to the distal end of the spool shaft <b>162</b> of the direction control valve <b>140</b>.</p>\n<p id=\"p-0045\" num=\"0044\">The foregoing description is presented to enable one of ordinary skill in the art to make and use the invention and is provided in the context of a patent application and its requirements. Various modifications to the preferred embodiment of the apparatus, and the general principles and features of the system and methods described herein will be readily apparent to those of skill in the art. Thus, the present invention is not to be limited to the embodiments of the apparatus, system and methods described above and illustrated in the drawing figures, but is to be accorded the widest scope consistent with the spirit and scope of the appended claims.</p>\n\n",
        "REL_APP_DESC": {
        },
        "DRAWING_DESC": {
            "raw": "\n<description-of-drawings>\n<heading id=\"h-0002\" level=\"1\">DESCRIPTION OF THE DRAWINGS</heading>\n<p id=\"p-0006\" num=\"0005\"><figref idref=\"DRAWINGS\">FIG. 1</figref> is a side elevation view of a conventional planter row unit showing the use of a prior art coil spring to provide supplemental downforce.</p>\n<p id=\"p-0007\" num=\"0006\"><figref idref=\"DRAWINGS\">FIG. 2</figref> is a schematic view of another conventional planter row unit showing the use of a prior art coil spring to provide supplemental downforce.</p>\n<p id=\"p-0008\" num=\"0007\"><figref idref=\"DRAWINGS\">FIG. 3</figref> is a side elevation view of the conventional planter row unit of <figref idref=\"DRAWINGS\">FIG. 1</figref> with an embodiment of a dynamic supplemental downforce control system.</p>\n<p id=\"p-0009\" num=\"0008\"><figref idref=\"DRAWINGS\">FIG. 4</figref> is a side elevation view of the conventional planter row unit of <figref idref=\"DRAWINGS\">FIG. 2</figref> with another embodiment of a dynamic supplemental downforce control system.</p>\n<p id=\"p-0010\" num=\"0009\"><figref idref=\"DRAWINGS\">FIG. 5</figref> is a schematic illustration of an embodiment of closed-loop feedback circuit for the dynamic supplemental downforce control system of <figref idref=\"DRAWINGS\">FIGS. 3 and 4</figref>.</p>\n<p id=\"p-0011\" num=\"0010\"><figref idref=\"DRAWINGS\">FIG. 6</figref> is a schematic view of an embodiment of the direction control valve for the supplemental downforce control systems of <figref idref=\"DRAWINGS\">FIGS. 3 and 4</figref>.</p>\n<p id=\"p-0012\" num=\"0011\"><figref idref=\"DRAWINGS\">FIGS. 7A-7C</figref> illustrate fluid flow and operation of the direction control valve and downforce actuator of <figref idref=\"DRAWINGS\">FIGS. 3 and 4</figref> utilizing fluid pressure from a pilot pressure control valve to impart the desired gauge wheel downforce Fd.</p>\n<p id=\"p-0013\" num=\"0012\"><figref idref=\"DRAWINGS\">FIGS. 8A-8C</figref> illustrate fluid flow and operation of the direction control valve and downforce actuator of <figref idref=\"DRAWINGS\">FIGS. 3 and 4</figref> utilizing a solenoid to impart the desired gauge wheel downforce Fd.</p>\n<p id=\"p-0014\" num=\"0013\"><figref idref=\"DRAWINGS\">FIG. 9</figref> is a schematic illustration of a portion of another embodiment of the closed-loop feedback circuit of <figref idref=\"DRAWINGS\">FIG. 5</figref> but with the pilot pressure control valve replaced with a manually operated pressure regulating valve.</p>\n<p id=\"p-0015\" num=\"0014\"><figref idref=\"DRAWINGS\">FIG. 10</figref> is a partial side elevation view of another embodiment of the dynamic supplemental downforce control system of <figref idref=\"DRAWINGS\">FIG. 4</figref> illustrating a piezoelectric load cell.</p>\n</description-of-drawings>\n",
            "normalized": "\n\n<h2 id=\"h-0002\" level=\"\">DESCRIPTION OF THE DRAWINGS</h2>\n<p id=\"p-0006\" num=\"0005\" level=\"\"><a idref=\"FIG-1\" id=\"FR-0001\" class=\"figref\">FIG. 1</a> is a side elevation view of a conventional planter row unit showing the use of a prior art coil spring to provide supplemental downforce.</p>\n<p id=\"p-0007\" num=\"0006\" level=\"\"><a idref=\"FIG-2\" id=\"FR-0002\" class=\"figref\">FIG. 2</a> is a schematic view of another conventional planter row unit showing the use of a prior art coil spring to provide supplemental downforce.</p>\n<p id=\"p-0008\" num=\"0007\" level=\"\"><a idref=\"FIG-3\" id=\"FR-0003\" class=\"figref\">FIG. 3</a> is a side elevation view of the conventional planter row unit of <a idref=\"FIG-1\" id=\"FR-0004\" class=\"figref\">FIG. 1</a> with an embodiment of a dynamic supplemental downforce control system.</p>\n<p id=\"p-0009\" num=\"0008\" level=\"\"><a idref=\"FIG-4\" id=\"FR-0005\" class=\"figref\">FIG. 4</a> is a side elevation view of the conventional planter row unit of <a idref=\"FIG-2\" id=\"FR-0006\" class=\"figref\">FIG. 2</a> with another embodiment of a dynamic supplemental downforce control system.</p>\n<p id=\"p-0010\" num=\"0009\" level=\"\"><a idref=\"FIG-5\" id=\"FR-0007\" class=\"figref\">FIG. 5</a> is a schematic illustration of an embodiment of closed-loop feedback circuit for the dynamic supplemental downforce control system of <a idref=\"FIG-3,FIG-4\" id=\"FR-0008\" class=\"figref\">FIGS. 3 and 4</a>.</p>\n<p id=\"p-0011\" num=\"0010\" level=\"\"><a idref=\"FIG-6\" id=\"FR-0009\" class=\"figref\">FIG. 6</a> is a schematic view of an embodiment of the direction control valve for the supplemental downforce control systems of <a idref=\"FIG-3,FIG-4\" id=\"FR-0010\" class=\"figref\">FIGS. 3 and 4</a>.</p>\n<p id=\"p-0012\" num=\"0011\" level=\"\"><a idref=\"FIG-7A,FIG-7C\" id=\"FR-0011\" class=\"figref\">FIGS. 7A-7C</a> illustrate fluid flow and operation of the direction control valve and downforce actuator of <a idref=\"FIG-3,FIG-4\" id=\"FR-0012\" class=\"figref\">FIGS. 3 and 4</a> utilizing fluid pressure from a pilot pressure control valve to impart the desired gauge wheel downforce Fd.</p>\n<p id=\"p-0013\" num=\"0012\" level=\"\"><a idref=\"FIG-8A,FIG-8C\" id=\"FR-0013\" class=\"figref\">FIGS. 8A-8C</a> illustrate fluid flow and operation of the direction control valve and downforce actuator of <a idref=\"FIG-3,FIG-4\" id=\"FR-0014\" class=\"figref\">FIGS. 3 and 4</a> utilizing a solenoid to impart the desired gauge wheel downforce Fd.</p>\n<p id=\"p-0014\" num=\"0013\" level=\"\"><a idref=\"FIG-9\" id=\"FR-0015\" class=\"figref\">FIG. 9</a> is a schematic illustration of a portion of another embodiment of the closed-loop feedback circuit of <a idref=\"FIG-5\" id=\"FR-0016\" class=\"figref\">FIG. 5</a> but with the pilot pressure control valve replaced with a manually operated pressure regulating valve.</p>\n<p id=\"p-0015\" num=\"0014\" level=\"\"><a idref=\"FIG-10\" id=\"FR-0017\" class=\"figref\">FIG. 10</a> is a partial side elevation view of another embodiment of the dynamic supplemental downforce control system of <a idref=\"FIG-4\" id=\"FR-0018\" class=\"figref\">FIG. 4</a> illustrating a piezoelectric load cell.</p>\n\n",
            "plain": "\nDESCRIPTION OF THE DRAWINGS\n\nPatent-Figure is a side elevation view of a conventional planter row unit showing the use of a prior art coil spring to provide supplemental downforce.\n\nPatent-Figure is a schematic view of another conventional planter row unit showing the use of a prior art coil spring to provide supplemental downforce.\n\nPatent-Figure is a side elevation view of the conventional planter row unit of Patent-Figure with an embodiment of a dynamic supplemental downforce control system.\n\nPatent-Figure is a side elevation view of the conventional planter row unit of Patent-Figure with another embodiment of a dynamic supplemental downforce control system.\n\nPatent-Figure is a schematic illustration of an embodiment of closed-loop feedback circuit for the dynamic supplemental downforce control system of Patent-Figure.\n\nPatent-Figure is a schematic view of an embodiment of the direction control valve for the supplemental downforce control systems of Patent-Figure.\n\nPatent-Figure illustrate fluid flow and operation of the direction control valve and downforce actuator of Patent-Figure utilizing fluid pressure from a pilot pressure control valve to impart the desired gauge wheel downforce Fd.\n\nPatent-Figure illustrate fluid flow and operation of the direction control valve and downforce actuator of Patent-Figure utilizing a solenoid to impart the desired gauge wheel downforce Fd.\n\nPatent-Figure is a schematic illustration of a portion of another embodiment of the closed-loop feedback circuit of Patent-Figure but with the pilot pressure control valve replaced with a manually operated pressure regulating valve.\n\nPatent-Figure is a partial side elevation view of another embodiment of the dynamic supplemental downforce control system of Patent-Figure illustrating a piezoelectric load cell.\n"
        },
        "BRIEF_SUMMARY": {
            "raw": "\n<heading id=\"h-0001\" level=\"1\">BACKGROUND</heading>\n<p id=\"p-0002\" num=\"0001\">It is recognized that sufficient downforce must be exerted on a planter row unit to ensure the desired furrow depth and soil compaction is achieved. If excessive downforce is applied, especially in soft or moist soils, the soil may be overly compacted which can affect the ability of germinating seeds to break through the soil. If insufficient downforce is applied, particularly in hard or dry soil, the planter may ride up and out of the soil resulting in insufficient depth of the furrow.</p>\n<p id=\"p-0003\" num=\"0002\">In the past, coiled springs extending between the parallel arms of the row units of the planter (see <figref idref=\"DRAWINGS\">FIG. 1</figref>) were often employed to provide the additional or “supplemental” downforce needed to ensure the desired furrow depth and soil compaction was achieved. By positioning the spring at various preset locations along the parallel arms, the amount of downforce exerted on the row unit could be increased or decreased. However, the amount of supplemental downforce exerted by the spring remained constant until the spring was repositioned. For example, when the planter encountered hard or dry soil such that greater supplemental downforce is necessary to maintain furrow depth or the desired soil compaction, the operator had to stop and adjust the location of the spring in order to increase the supplemental downforce. Furthermore, during operation, as the seed or fertilizer in the hoppers was dispensed, the weight of the row unit gradually decreased causing a corresponding reduction in the total downforce on the gauge wheels, because the supplemental downforce exerted by the spring remained substantially constant until the spring was manually repositioned.</p>\n<p id=\"p-0004\" num=\"0003\">More advanced supplemental downforce systems, such as disclosed in U.S. application Ser. No. 12/679,710 (Pub. No. US2010/0198529) by Sauder et al. (hereinafter “the Sauder '710 Application”), which is incorporated herein in its entirety by reference, measure the strain in a member of the gauge wheel adjusting mechanism to determine the force being exerted against the gauge wheels to determine the downforce. A central processor or controller actuates the hydraulic or pneumatic cylinders, airbags or other actuators to increase or decrease the supplemental downforce across all the row units. While such systems may serve their intended purpose, they can be more costly because they require central processing circuitry as well as hydraulic or pneumatic valves, load sensors, and associated cable harnesses at each row unit in order to properly maintain the desired downforce. Moreover, the required processing steps increase the response time of such a system as compared with the use of coil springs or other earlier mechanical systems for supplying supplemental downforce. In addition, central control systems that apply a common supplemental downforce to each row unit fail to respond to unique loads experienced by each row unit, such that insufficient or excessive supplemental downforce may be applied to any given row unit.</p>\n<p id=\"p-0005\" num=\"0004\">Thus, there is a need for a supplemental downforce control system that maintains a desired downforce at each row unit and additionally allows an operator to set the desired downforce from the tractor cab while on-the-go during planting operations.</p>\n",
            "normalized": "\n<h2 id=\"h-0001\" level=\"\">BACKGROUND</h2>\n<p id=\"p-0002\" num=\"0001\" level=\"\">It is recognized that sufficient downforce must be exerted on a planter row unit to ensure the desired furrow depth and soil compaction is achieved. If excessive downforce is applied, especially in soft or moist soils, the soil may be overly compacted which can affect the ability of germinating seeds to break through the soil. If insufficient downforce is applied, particularly in hard or dry soil, the planter may ride up and out of the soil resulting in insufficient depth of the furrow.</p>\n<p id=\"p-0003\" num=\"0002\" level=\"\">In the past, coiled springs extending between the parallel arms of the row units of the planter (see <a idref=\"FIG-1\" id=\"FR-0001\" class=\"figref\">FIG. 1</a>) were often employed to provide the additional or “supplemental” downforce needed to ensure the desired furrow depth and soil compaction was achieved. By positioning the spring at various preset locations along the parallel arms, the amount of downforce exerted on the row unit could be increased or decreased. However, the amount of supplemental downforce exerted by the spring remained constant until the spring was repositioned. For example, when the planter encountered hard or dry soil such that greater supplemental downforce is necessary to maintain furrow depth or the desired soil compaction, the operator had to stop and adjust the location of the spring in order to increase the supplemental downforce. Furthermore, during operation, as the seed or fertilizer in the hoppers was dispensed, the weight of the row unit gradually decreased causing a corresponding reduction in the total downforce on the gauge wheels, because the supplemental downforce exerted by the spring remained substantially constant until the spring was manually repositioned.</p>\n<p id=\"p-0004\" num=\"0003\" level=\"\">More advanced supplemental downforce systems, such as disclosed in U.S. application Ser. No. 12/679,710 (Pub. No. US2010/0198529) by Sauder et al. (hereinafter “the Sauder '710 Application”), which is incorporated herein in its entirety by reference, measure the strain in a member of the gauge wheel adjusting mechanism to determine the force being exerted against the gauge wheels to determine the downforce. A central processor or controller actuates the hydraulic or pneumatic cylinders, airbags or other actuators to increase or decrease the supplemental downforce across all the row units. While such systems may serve their intended purpose, they can be more costly because they require central processing circuitry as well as hydraulic or pneumatic valves, load sensors, and associated cable harnesses at each row unit in order to properly maintain the desired downforce. Moreover, the required processing steps increase the response time of such a system as compared with the use of coil springs or other earlier mechanical systems for supplying supplemental downforce. In addition, central control systems that apply a common supplemental downforce to each row unit fail to respond to unique loads experienced by each row unit, such that insufficient or excessive supplemental downforce may be applied to any given row unit.</p>\n<p id=\"p-0005\" num=\"0004\" level=\"\">Thus, there is a need for a supplemental downforce control system that maintains a desired downforce at each row unit and additionally allows an operator to set the desired downforce from the tractor cab while on-the-go during planting operations.</p>\n",
            "plain": "\nBACKGROUND\n\nIt is recognized that sufficient downforce must be exerted on a planter row unit to ensure the desired furrow depth and soil compaction is achieved. If excessive downforce is applied, especially in soft or moist soils, the soil may be overly compacted which can affect the ability of germinating seeds to break through the soil. If insufficient downforce is applied, particularly in hard or dry soil, the planter may ride up and out of the soil resulting in insufficient depth of the furrow.\n\nIn the past, coiled springs extending between the parallel arms of the row units of the planter (see Patent-Figure) were often employed to provide the additional or “supplemental” downforce needed to ensure the desired furrow depth and soil compaction was achieved. By positioning the spring at various preset locations along the parallel arms, the amount of downforce exerted on the row unit could be increased or decreased. However, the amount of supplemental downforce exerted by the spring remained constant until the spring was repositioned. For example, when the planter encountered hard or dry soil such that greater supplemental downforce is necessary to maintain furrow depth or the desired soil compaction, the operator had to stop and adjust the location of the spring in order to increase the supplemental downforce. Furthermore, during operation, as the seed or fertilizer in the hoppers was dispensed, the weight of the row unit gradually decreased causing a corresponding reduction in the total downforce on the gauge wheels, because the supplemental downforce exerted by the spring remained substantially constant until the spring was manually repositioned.\n\nMore advanced supplemental downforce systems, such as disclosed in U.S. application Ser. No. 12/679,710 (Pub. No. US2010/0198529) by Sauder et al. (hereinafter “the Sauder '710 Application”), which is incorporated herein in its entirety by reference, measure the strain in a member of the gauge wheel adjusting mechanism to determine the force being exerted against the gauge wheels to determine the downforce. A central processor or controller actuates the hydraulic or pneumatic cylinders, airbags or other actuators to increase or decrease the supplemental downforce across all the row units. While such systems may serve their intended purpose, they can be more costly because they require central processing circuitry as well as hydraulic or pneumatic valves, load sensors, and associated cable harnesses at each row unit in order to properly maintain the desired downforce. Moreover, the required processing steps increase the response time of such a system as compared with the use of coil springs or other earlier mechanical systems for supplying supplemental downforce. In addition, central control systems that apply a common supplemental downforce to each row unit fail to respond to unique loads experienced by each row unit, such that insufficient or excessive supplemental downforce may be applied to any given row unit.\n\nThus, there is a need for a supplemental downforce control system that maintains a desired downforce at each row unit and additionally allows an operator to set the desired downforce from the tractor cab while on-the-go during planting operations.\n"
        },
        "DETAILED_DESC": {
            "raw": "\n<heading id=\"h-0003\" level=\"1\">DESCRIPTION</heading>\n<p id=\"p-0016\" num=\"0015\">Referring now to the drawings, wherein like reference numerals designate identical or corresponding parts throughout the several views, <figref idref=\"DRAWINGS\">FIG. 1</figref> illustrates a side elevation view of a single row unit <b>10</b> of a conventional row crop planter such as the type disclosed in U.S. Pat. No. 4,009,668, incorporated herein in its entirety by reference. As is well known in the art, the row units <b>10</b> are mounted in spaced relation along the length of a transverse toolbar <b>12</b> by a parallel linkage <b>14</b>, comprised of upper and lower parallel arms <b>16</b>, <b>18</b> pivotally mounted at a forward end to the transverse toolbar <b>12</b> and at their rearward end to the row unit frame <b>20</b>. The parallel linkage <b>14</b> permits each row unit <b>10</b> to move vertically independently of the toolbar <b>12</b> and independently of the other spaced row units in order to accommodate changes in terrain or upon the row unit encountering a rock or other obstruction as the planter is drawn through the field.</p>\n<p id=\"p-0017\" num=\"0016\">The row unit frame <b>20</b> operably supports a seed hopper <b>22</b>, and a smaller hopper <b>24</b> for insecticide and/or fertilizer, a seed meter <b>26</b> and a seed tube <b>28</b> as well as a furrow opener assembly <b>30</b> and furrow closing assembly <b>40</b>. The furrow opening assembly <b>30</b> comprises a pair of furrow opener discs <b>32</b> and a pair of gauge wheels <b>34</b>. The gauge wheels <b>34</b> are pivotally secured to the row unit frame <b>20</b> by gauge wheel arms <b>36</b>. A furrow depth adjusting member <b>38</b> adjustably positions the gauge wheels <b>34</b> relative to the furrow opener discs <b>32</b> for establishing the desired furrow depth. A coil spring <b>50</b> is disposed between the parallel arms <b>16</b>, <b>18</b> to provide supplemental downforce to ensure that the furrow opener discs <b>32</b> fully penetrate the soil to the desired depth as set by the depth adjusting member <b>38</b> and to provide soil compaction for proper furrow formation. Rather than a coil spring, supplemental downforce may be provided by actuators or other suitable means such as disclosed in U.S. Pat. No. 6,389,999 to Duello, U.S. Pat. No. 6,701,857 to Jensen, in European Patent No. EP0372901 to Baker, and/or the Sauder '710 Application.</p>\n<p id=\"p-0018\" num=\"0017\">In operation, as the row unit <b>10</b> is lowered to the planting position, the opener discs <b>32</b> penetrate into the soil. At the same time, the soil forces the gauge wheels <b>34</b> to pivot upwardly until the gauge wheel arms <b>36</b> abut or come into contact with the stop position previously set with furrow depth adjusting member <b>38</b> or until a static load balance is achieved between the vertical load of the row unit and the reaction of the soil. As the planter is drawn forwardly in the direction indicated by arrow <b>39</b>, the furrow opener discs cut a V-shaped furrow <b>60</b> into the soil while the gauge wheels <b>34</b> compact the soil to aid in formation of the V-shaped furrow. Individual seeds <b>62</b> from the seed hopper <b>22</b> are dispensed by the seed meter <b>26</b> into the seed tube <b>28</b> in uniformly spaced increments. The seed tube <b>28</b> directs the individual dispensed seeds <b>62</b> downwardly and rearwardly between the furrow opener discs <b>32</b> and into the bottom of the V-shaped furrow <b>60</b>. The furrow <b>60</b> is then covered with soil and lightly compacted by the furrow closing assembly <b>40</b>.</p>\n<p id=\"p-0019\" num=\"0018\"><figref idref=\"DRAWINGS\">FIG. 2</figref> illustrates a side view of another embodiment of a conventional row unit <b>10</b> for a central-fill planter such as disclosed in U.S. Pat. No. 7,438,006, incorporated herein in its entirety by reference. As in the row unit embodiment of <figref idref=\"DRAWINGS\">FIG. 1</figref>, the row unit embodiment of <figref idref=\"DRAWINGS\">FIG. 2</figref> includes a parallel arm linkage <b>14</b> comprised of upper and lower parallel arms <b>16</b>, <b>18</b> pivotally mounted at a forward end to the transverse toolbar <b>12</b> and at their rearward end to the row unit frame <b>20</b>. The row unit frame <b>20</b> supports a mini seed hopper <b>23</b>, seed meter <b>26</b>, a seed tube <b>28</b>, as well as the furrow opener assembly <b>30</b>, comprising a furrow opener discs <b>32</b> and gauge wheels <b>34</b>. The gauge wheels <b>34</b> are pivotally secured to the row unit frame <b>20</b> by gauge wheel arms <b>36</b>. Unlike the embodiment of <figref idref=\"DRAWINGS\">FIG. 1</figref>, the gauge wheel arms <b>36</b> in the embodiment of <figref idref=\"DRAWINGS\">FIG. 2</figref> extend forwardly of the gauge wheels <b>34</b>.</p>\n<p id=\"p-0020\" num=\"0019\">The row units <b>10</b> in <figref idref=\"DRAWINGS\">FIGS. 3 and 4</figref> are substantially the same as the row units <b>10</b> depicted in <figref idref=\"DRAWINGS\">FIGS. 1 and 2</figref>, respectively, except that in <figref idref=\"DRAWINGS\">FIGS. 3 and 4</figref>, the coil springs <b>50</b> have been removed and replaced with an embodiment of a dynamic supplemental downforce control system <b>100</b> in accordance with the present invention.</p>\n<p id=\"p-0021\" num=\"0020\"><figref idref=\"DRAWINGS\">FIG. 5</figref> schematically illustrates a preferred embodiment of the automated supplemental downforce control system <b>100</b> which comprises a closed-loop feedback circuit <b>110</b> that cooperates with a downforce actuator <b>200</b>. Preferably, the dynamic system <b>100</b> utilizes the hydraulic system of the tractor pulling the planter and therefore preferably comprises an electro-hydraulic closed-loop feedback circuit <b>110</b> and a dual action hydraulic cylinder <b>200</b>. However, the dynamic system <b>100</b> may be equally adapted for use with pneumatic actuators in cooperation with any corresponding electro-pneumatic closed-loop feedback circuit. It should also be appreciated that although the schematic illustration of <figref idref=\"DRAWINGS\">FIG. 5</figref> shows the dynamic system <b>100</b> in relation to a four-row planters, the dynamic system <b>100</b> can be adapted to a planter with any number of row units.</p>\n<p id=\"p-0022\" num=\"0021\">As used herein, the term “actual gauge wheel downforce” Fa (<figref idref=\"DRAWINGS\">FIGS. 3 and 4</figref>) refers to the dead load, live load and supplemental downforce transferred to the soil through the gauge wheels <b>34</b> of the row unit <b>10</b>. The row unit dead load is understood to be the mass of the entire row unit and any accessories mounted thereon. Therefore, the row unit dead load remains substantially constant and would include the mass of the row unit frame <b>20</b>, the furrow opening assembly <b>30</b>, the furrow closing assembly <b>40</b>, the hoppers <b>22</b>, <b>24</b>, seed meter <b>26</b>, seed tube <b>28</b> and the mass of any other attachments or devices operably supported or carried by the row unit frame. The row unit live load is understood to be the mass of the seed, insecticide and/or fertilizer within the hoppers <b>22</b>, <b>24</b>, <b>23</b> of the row unit or otherwise carried by the row unit. The live load typically varies as the material is dispensed during planting operations.</p>\n<p id=\"p-0023\" num=\"0022\">The term “supplemental downforce,” as used herein refers to the loading, other than the live load and dead load, that is applied to the row unit to force the row unit downwardly or upwardly relative to the toolbar <b>12</b> to achieve the desired furrow depth and soil compaction under the gauge wheels <b>34</b>. It should be understood that the supplemental downforce may increase or decrease the actual gauge wheel downforce Fa. It is recognized that a certain amount of the row unit dead load, live load and supplemental downforce is carried by the furrow opener discs <b>32</b> and the furrow closing assembly <b>40</b>. Nevertheless, because the preferred system and method <b>100</b> disclosed herein preferably involves only the forces or loads exerted on or transferred by the gauge wheels, then loads transferred by the opener discs and closing wheel need not be considered.</p>\n<p id=\"p-0024\" num=\"0023\">Referring to <figref idref=\"DRAWINGS\">FIGS. 3 and 4</figref>, it should be appreciated that if the downforce actuator <b>200</b> is extended, the row unit <b>10</b> will be forced downwardly relative to toolbar <b>12</b>, resulting in an increase in the supplemental downforce and a corresponding increase in the actual gauge wheel downforce Fa. Likewise, if the downforce actuator <b>200</b> is retracted, the row unit <b>10</b> will be pulled upwardly relative to the toolbar <b>12</b>, resulting in a decrease in the supplemental downforce and a corresponding reduction in the actual gauge wheel downforce Fa.</p>\n<p id=\"p-0025\" num=\"0024\">Referring to <figref idref=\"DRAWINGS\">FIG. 5</figref>, the preferred electro-hydraulic closed-loop feedback circuit <b>110</b> comprises a control module <b>112</b>, a pilot pressure control valve <b>114</b>, one load sensor <b>116</b> (preferably one per row unit), at least one direction control valve <b>140</b> (preferably one per row unit), fluid lines <b>122</b> and signal lines <b>124</b>. As described in greater detail later, a lever <b>136</b> (<figref idref=\"DRAWINGS\">FIGS. 3 and 4</figref>) is preferably disposed to transmit the up and down directional displacement of the gauge wheels and thus the corresponding actual gauge wheel downforce Fa, to the direction control valve <b>140</b>. The signal lines <b>124</b> communicate electrical signals between the control module <b>112</b>, the load sensor <b>116</b>, the pilot pressure valve <b>114</b>, and the direction control valve <b>140</b>. The fluid lines communicate hydraulic fluid between a fluid source <b>130</b>, the pilot pressure control valve <b>114</b>, the direction control valve <b>140</b> and the downforce actuator <b>200</b>. The fluid source <b>130</b> is preferably the hydraulic fluid reservoir of the tractor pulling the planter. It should be appreciated that if the dynamic system <b>100</b> is an electro-pneumatic system, the fluid source may be an air compressor, compressed air tank or other suitable air source.</p>\n<p id=\"p-0026\" num=\"0025\">In general, through the control module <b>112</b>, the operator is able to set the desired gauge wheel downforce Fd, which, in one embodiment, corresponds to the output pressure of the pilot pressure control valve <b>114</b>. The control module <b>112</b> also preferably permits the operator to view the actual gauge wheel downforce Fa of the row units <b>10</b> as detected by the load sensors <b>116</b>. The direction control valve <b>140</b> permits fluid flow to and from the individual downforce actuators <b>200</b> in response to any imbalance between the desired gauge wheel downforce Fd acting at one end of the direction control valves <b>140</b> against the actual gauge wheel downforce Fa acting at the other end of the direction control valves <b>140</b>. Thus, the dynamic system <b>100</b> independently and dynamically adjusts the supplemental downforce for each individual row unit as each row unit experiences unique loading conditions during planting operations. The downforce adjustment occurs without the need for complex and expensive central processing circuitry or software programming that would otherwise be required to simultaneously monitor and compare the desired gauge wheel downforce Fd with the actual gauge wheel downforce Fa across all row units and to then send signals to independently control the downforce actuators <b>200</b> at each row unit.</p>\n<p id=\"p-0027\" num=\"0026\">Although it is preferable for each row unit <b>10</b> to have separate load sensor <b>116</b> so the operator can monitor the actual gauge wheel downforce for each row, it may be desirable to have load sensors on only certain row units, such as on the outside row units and one or two inner row units. It should also be appreciated that although it is desirable for each row unit <b>10</b> to have a direction control valve <b>140</b>, a single direction control valve <b>140</b> may be used to control fluid flow to the downforce actuators <b>200</b> of multiple row units. Similarly a single downforce actuator <b>200</b> may be utilized to control the supplemental downforce across multiple row units.</p>\n<p id=\"p-0028\" num=\"0027\">The pilot pressure control valve <b>114</b> is in fluid communication with the fluid source <b>130</b> via fluid lines <b>122</b><i>a </i>and the direction control valve <b>140</b> via fluid lines <b>122</b><i>b</i>. It is also in electrical communication with the control module <b>112</b> via signal lines <b>124</b><i>a</i>. The operator is able to set the desired output pressure of the pilot pressure control valve <b>114</b> via the control module <b>112</b>. Suitable pilot pressure control valves include solenoid-operated proportional valves such as model no. PV72-21 distributed by HydraForce, Inc. in Lincolnshire, Ill.</p>\n<p id=\"p-0029\" num=\"0028\">The load sensor <b>116</b> is disposed to preferably generate an electrical signal corresponding to the actual gauge wheel downforce Fa (<figref idref=\"DRAWINGS\">FIGS. 3-5</figref>). The control module <b>112</b> receives the generated signal from the load sensor <b>116</b> via the signal lines <b>124</b><i>b </i>and preferably displays to the operator the actual gauge wheel downforce Fa corresponding to the generated signal. In a preferred embodiment, the load sensor <b>116</b> is a strain gauge such as a Wheatstone bridge circuit mounted in any suitable location from which the actual gauge wheel downforce Fa can be reasonably accurately determined. For example, the load sensor <b>116</b> may be mounted to detect the strain in the gauge wheel arm <b>36</b> (<figref idref=\"DRAWINGS\">FIGS. 4 and 5</figref>) such as disclosed in U.S. Pat. No. 6,389,999 to Duello, or U.S. Pat. No. 6,701,857 to Jensen, or the strain in the pivot pin of the depth adjusting member <b>38</b> (<figref idref=\"DRAWINGS\">FIG. 3</figref>), such as disclosed in the Sauder '253 Application, or in the equalizer for the depth adjusting member as disclosed in U.S. Provisional Application No. 60/883,957 filed Jan. 8, 2008 by Sauder et al., or in a location such as disclosed in European Patent No. EP0372901 to Baker. All of the above-referenced patents and/or patent applications are incorporated herein in their entireties by reference.</p>\n<p id=\"p-0030\" num=\"0029\">The control module <b>112</b> is preferably integrated into an existing planter monitor that provides a user interface, such as a touch screen, keypad or other input means, through which the operator can select or input the desired gauge wheel downforce Fd. The control module <b>112</b> is also preferably integrated into an existing planter monitor that provides a display screen or other visual display through which the operator can view and monitor the actual gauge wheel downforce Fa of the row units. In a preferred embodiment, the control module <b>112</b> is integrated into the 20/20® planter monitor system sold by Precision Planting, Inc., of Tremont, Ill. and as disclosed in U.S. patent application Ser. No. 12/522,252 (Pub. No. US2010/0010667) by Sauder et al., incorporated herein in its entirety by reference. Those skilled in the art would readily understand how to modify the 20/20® planter monitor or any other planter monitor to integrate the additional programming and circuitry necessary to allow an operator to input a desired gauge wheel downforce Fd for controlling the output of the pilot pressure valve <b>114</b> and to also receive and display the actual gauge wheel downforce Fa as detected by the load sensor <b>116</b>. Alternatively, as would be recognized by those skilled in the art, the control module <b>112</b> may be a standalone system incorporating the necessary circuitry for controlling the output pressure of the pilot control valve <b>114</b> corresponding to the desired gauge wheel downforce Fd, and/or for displaying the actual gauge wheel downforce Fa of the row units. Regardless of whether the control module <b>112</b> is integrated into an existing planter monitor system or as a standalone unit, it is preferably mounted in the cab of the tractor in a location where an operator can view and interact with the user interface during planting operations.</p>\n<p id=\"p-0031\" num=\"0030\">Referring to <figref idref=\"DRAWINGS\">FIGS. 6 and 7A-7C</figref>, the direction control valve <b>140</b> is preferably a three-position directional control valve similar such as model no. PTS16-12 distributed by Eaton Corporation, Eden Prairie, Minn. The direction control valve <b>140</b> preferably includes a housing <b>142</b> having an axial through-bore <b>144</b> and an enlarged counterbore <b>146</b>. A series of ports extend transversely through the sidewall <b>148</b> of the housing <b>142</b> and into the axial through-bore <b>144</b>, preferably including an inlet port <b>150</b>, first and second fluid return ports <b>152</b>, <b>154</b>, and first and second actuator ports <b>156</b>, <b>158</b>. A spool <b>160</b> is slidably disposed within the housing <b>142</b>. The spool <b>160</b> has a shaft <b>162</b> and an enlarged head <b>164</b>. The enlarged head <b>164</b> is disposed within the counterbore <b>146</b>. A spring <b>166</b> biases the spool head <b>164</b> leftward as viewed in <figref idref=\"DRAWINGS\">FIG. 6</figref>. The shaft <b>162</b> includes two longitudinally spaced circumferential rings <b>168</b>. The circumferential rings <b>168</b> define raised surfaces, which, when aligned with the first and second actuator ports <b>156</b>, <b>158</b> as shown in <figref idref=\"DRAWINGS\">FIG. 6</figref> effectively block the flow of fluid into or out of the ports and prevent passage of fluid from one side of the circumferential ring to the other. Thus, as illustrated in <figref idref=\"DRAWINGS\">FIGS. 7A-7C</figref>, the movement of the spool <b>160</b> within the through-bore <b>144</b> functions as a three position valve. The direction control valve <b>140</b> further includes a head cap <b>170</b> and an end cap <b>172</b>. The head cap <b>170</b> includes an axial end port <b>174</b> in fluid communication with an axial counterbore <b>176</b>. A block <b>178</b> is slidably disposed within the axial counterbore <b>176</b> and abuts the spring biased spool head <b>164</b>. The end cap <b>172</b> has an axial bore <b>180</b> through which the distal end of the spool shaft <b>162</b> extends. O-rings <b>182</b> are provided to fluidly seal the head cap <b>170</b> and end cap <b>172</b> with the housing <b>142</b>.</p>\n<p id=\"p-0032\" num=\"0031\">In operation, referring to <figref idref=\"DRAWINGS\">FIGS. 5, 6 and 7A-7C</figref>, fluid lines <b>122</b><i>b </i>communicate fluid from the pilot pressure valve <b>114</b> to the axial end port <b>174</b> of the direction control valves <b>140</b> at a pressure corresponding to the desired gauge wheel downforce Fd. Another set of fluid lines <b>122</b><i>c </i>communicate pressurized fluid from the fluid pressure source <b>130</b> to the inlet port <b>150</b> of each direction control valve <b>140</b>. Another set of fluid lines <b>122</b><i>d </i>communicate fluid between the fluid return ports <b>152</b>, <b>154</b> back to the fluid source <b>130</b>. Another set of fluid lines <b>122</b><i>e </i>communicate fluid between the first and second actuator ports <b>156</b>, <b>158</b> to each side of the piston <b>202</b> within the downforce actuator <b>200</b> of each row unit <b>10</b>. The lever <b>136</b> (<figref idref=\"DRAWINGS\">FIGS. 3 and 4</figref>) transmits the opposing actual gauge wheel downforce Fa to the distal end of the spool shaft <b>162</b> of the direction control valve <b>140</b>.</p>\n<p id=\"p-0033\" num=\"0032\">As depicted in <figref idref=\"DRAWINGS\">FIG. 7A</figref>, if the desired gauge wheel downforce Fd is the same as the actual gauge wheel downforce Fa transmitted by the lever <b>136</b> (i.e., Fd=Fa), the circumferential rings <b>168</b> on the spool shaft <b>162</b> are preferably aligned with the first and second actuator ports <b>156</b>, <b>158</b> thereby preventing fluid flow to and from the downforce actuator <b>200</b>.</p>\n<p id=\"p-0034\" num=\"0033\">As depicted in <figref idref=\"DRAWINGS\">FIG. 7B</figref>, if the desired gauge wheel downforce Fd is greater than the actual gauge wheel downforce Fa transmitted by the lever <b>136</b> (i.e., Fd&gt;Fa), the spool shaft <b>162</b> will be forced to the right opening fluid communication between the fluid inlet port <b>150</b> and the second actuator port <b>158</b> and opening fluid communication between the first actuator port <b>156</b> and the first fluid return port <b>152</b> thereby allowing fluid to flow into the piston end of the downforce actuator <b>200</b> and out through the rod end of the downforce actuator <b>200</b> forcing the piston <b>202</b> downwardly thereby increasing the actual gauge wheel downforce Fa. When the actual gauge wheel downforce Fa is sufficiently increased to rebalance with the desired gauge wheel downforce Fd, the spool shaft <b>162</b> will return to the position as show in <figref idref=\"DRAWINGS\">FIG. 7A</figref>.</p>\n<p id=\"p-0035\" num=\"0034\">As depicted in <figref idref=\"DRAWINGS\">FIG. 7C</figref>, if the desired gauge wheel downforce Fd is less than the actual gauge wheel downforce Fa transmitted by the lever <b>136</b> (i.e., Fd&lt;Fa), the spool shaft <b>162</b> will be forced to the left opening fluid communication between the fluid inlet port <b>150</b> and the first actuator port <b>156</b> and opening fluid communication between the second actuator port <b>158</b> and the second fluid return port <b>154</b> thereby allowing fluid to flow into the rod end of the downforce actuator <b>200</b> and out through the piston end of the downforce actuator <b>200</b> forcing the piston <b>202</b> upwardly thereby decreasing the actual gauge wheel downforce Fa. When the actual gauge wheel downforce Fa is sufficiently decreased to rebalance with the desired gauge wheel downforce Fd, the spool shaft <b>162</b> will return to the position as shown in <figref idref=\"DRAWINGS\">FIG. 7A</figref>.</p>\n<p id=\"p-0036\" num=\"0035\">It should be understood that instead of a system that utilizes a pilot pressure control valve <b>114</b> to transmit the desired gauge wheel downforce Fd to the direction control valve <b>140</b>, any suitable electrical or electro-mechanical device may be used to transmit the desired gauge wheel downforce Fd to the direction control valve <b>140</b>. For example, as illustrated in <figref idref=\"DRAWINGS\">FIGS. 8A-8C</figref>, a solenoid <b>400</b> may be employed to transmit the desired gauge wheel downforce Fd against spool head <b>164</b>. In such an embodiment, the control module <b>112</b> would send an electrical signal to the solenoid <b>400</b> to cause the solenoid plunger <b>402</b> to be displaced corresponding to the desired gauge wheel downforce Fd which in turn acts upon the spool head <b>164</b> causing the corresponding displacement of the spool <b>160</b> to open and close the ports as described and illustrated in connection with <figref idref=\"DRAWINGS\">FIGS. 7A-7B</figref>.</p>\n<p id=\"p-0037\" num=\"0036\">It should also be understood that the term “direction control valve” <b>140</b> should not be construed as being limited to the embodiment described and illustrated herein, but should instead be understood to include any device or combination of devices that allows fluid flow to and/or from the downforce actuator <b>200</b> when the actual gauge wheel downforce Fa becomes imbalanced with the desired gauge wheel downforce Fd.</p>\n<p id=\"p-0038\" num=\"0037\">Because the gauge wheels <b>34</b> may occasionally encounter rocks or other obstructions during planting operations that may cause high impact forces, the direction control valve <b>140</b> is preferably mounted in a manner to avoid damage from the impact forces. For example, the direction control valve <b>140</b> is preferably bias mounted to allow the control valve <b>140</b> to displace longitudinally if an abrupt force imposed by the lever <b>136</b> on the spool <b>160</b> causes the spool head <b>164</b> to bottom out against the head cap <b>170</b>. When the abrupt force is removed, the bias mount returns the direction control valve <b>140</b> to its normal position.</p>\n<p id=\"p-0039\" num=\"0038\">In a preferred embodiment, the control module <b>112</b> cooperates with a Global Positioning System (GPS) and is configured to access a desired downforce prescription map for setting and/or modifying the desired gauge wheel downforce Fd as the planter traverses the field. The downforce prescription map may be based upon soil types, elevations, or location-specific preferences set by the operator prior to operation. In such an embodiment, the control module <b>112</b> may be used to specify a different desired gauge wheel downforce Fd to each row unit or groups of row units to more accurately follow the downforce prescription map. For example, if the locations of the far right row unit and the far left row unit on the planter correspond to different prescribed desired gauge wheel downforces Fd based on soil type or other predefined factor, the control module <b>12</b> is preferably capable of setting the appropriate desired gauge wheel downforce Fd for each of the row units.</p>\n<p id=\"p-0040\" num=\"0039\">In addition, the control module <b>112</b> is preferably configured to determine and display a ground contact percentage as disclosed in applicant's co-pending international patent application no. PCT/US2008/050427 (Pub. No. WO2009/042238), which is incorporated herein in its entirety by reference. The control module <b>112</b> is preferably configured to allow the operator to select a desired minimum ground contact percentage in addition to, or rather than, inputting a specific desired gauge wheel downforce Fd. In such an embodiment, the desired gauge wheel downforce Fd would be the desired minimum ground contact percentage. The dynamic system <b>100</b> would adjust the supplemental downforce until the actual gauge wheel downforce Fa in relation to the desired gauge wheel downforce Fd resulted in the desired minimum ground contact percentage over the sampling period. Thus, as used herein, the term “desired gauge wheel downforce Fd” should be understood to include a force that may be expressed as a numerical value or as a percentage of ground contact.</p>\n<p id=\"p-0041\" num=\"0040\">The closed-loop feedback circuit <b>110</b> preferably cooperates with a transport position detector <b>300</b> (<figref idref=\"DRAWINGS\">FIG. 5</figref>), such as a height sensor or contact switch disposed on the frame of the planter, to detect when the planter is raised into a transport position. It should be appreciated that when the planter is raised, the gauge wheel arms <b>36</b> will pivot downwardly resulting in the load sensor <b>116</b> to sense zero or near zero actual gauge wheel downforce Fa, which in turn will result in fluid flow to the downforce actuator <b>200</b> until it is fully extended. To prevent such a result from occurring, the transport position detector <b>300</b> is preferably in electrical communication with a valve <b>310</b> disposed along the fluid supply line <b>122</b><i>c</i>. When the detector <b>300</b> detects that the planter is in a transport position, the valve <b>310</b> is closed to prevent the flow of fluid from the fluid source <b>130</b> to the fluid inlet ports <b>150</b> of the direction control valves <b>140</b> of the row units <b>10</b>. The valve <b>310</b> is preferably a two-position normally open solenoid valve.</p>\n<p id=\"p-0042\" num=\"0041\">Alternatively, instead of a separate valve <b>310</b> disposed in the fluid supply line <b>122</b><i>c</i>, the transport position detector <b>300</b> may be in electrical communication with the pilot pressure control valve <b>114</b> such that when the planter is raised into the transport position, the transport position detector <b>300</b> sends a signal to cause the pilot pressure control valve <b>114</b> to close. In such an event the downforce actuators <b>200</b> will automatically “raise” in an effort to rebalance the load between Fd and Fa, by allowing fluid to flow through the direction control valve <b>140</b> as indicated in <figref idref=\"DRAWINGS\">FIG. 7C or 8C</figref>, because Fd will be zero when the pilot pressure control valve <b>114</b> is closed. When the load sensor <b>116</b> senses zero when the gauge wheels are raised above the soil such that Fd=Fa, the direction control valve <b>140</b> will return to the position illustrated in <figref idref=\"DRAWINGS\">FIG. 7A or 8A</figref> preventing fluid flow to the downforce actuator <b>200</b>.</p>\n<p id=\"p-0043\" num=\"0042\">Furthermore, it should be understood that the pilot pressure control valve <b>114</b> and the control module <b>112</b> may be combined into a single manually operated pressure regulating valve. In such an embodiment, the manually operated pressure regulating valve would preferably include labels or markers relating each pressure setting to the gauge wheel reaction force. In the same embodiment, the output pilot pressures corresponding to the desired gauge wheel downforce Fd would also be set manually. Such an embodiment is shown in <figref idref=\"DRAWINGS\">FIG. 9</figref>, which illustrates a portion of the closed-loop feedback circuit <b>110</b> wherein control module <b>112</b> and the pilot pressure valve <b>114</b> are replaced by a manually operated pressure regulating valve <b>400</b>. The valve <b>400</b> includes a controller <b>402</b> such as a dial or knob, and settings <b>404</b> corresponding to the desired gauge wheel downforce Fd, which may be indicated in pounds force as illustrated or in any other desired units.</p>\n<p id=\"p-0044\" num=\"0043\">In another embodiment, the load sensor <b>116</b> may include a piezoelectric load cell such as a compression load cell model no. FSH00402 available from Futek in Irvine, Calif., which may be disposed between the direction control valve <b>140</b> and the lever <b>136</b>. Such an embodiment is illustrated in <figref idref=\"DRAWINGS\">FIG. 10</figref>, in which a load cell <b>116</b> is mounted to the distal end of the spool shaft <b>162</b> of the direction control valve <b>140</b>.</p>\n<p id=\"p-0045\" num=\"0044\">The foregoing description is presented to enable one of ordinary skill in the art to make and use the invention and is provided in the context of a patent application and its requirements. Various modifications to the preferred embodiment of the apparatus, and the general principles and features of the system and methods described herein will be readily apparent to those of skill in the art. Thus, the present invention is not to be limited to the embodiments of the apparatus, system and methods described above and illustrated in the drawing figures, but is to be accorded the widest scope consistent with the spirit and scope of the appended claims.</p>\n",
            "normalized": "\n<h2 id=\"h-0003\" level=\"\">DESCRIPTION</h2>\n<p id=\"p-0016\" num=\"0015\" level=\"\">Referring now to the drawings, wherein like reference numerals designate identical or corresponding parts throughout the several views, <a idref=\"FIG-1\" id=\"FR-0001\" class=\"figref\">FIG. 1</a> illustrates a side elevation view of a single row unit <b>10</b> of a conventional row crop planter such as the type disclosed in U.S. Pat. No. 4,009,668, incorporated herein in its entirety by reference. As is well known in the art, the row units <b>10</b> are mounted in spaced relation along the length of a transverse toolbar <b>12</b> by a parallel linkage <b>14</b>, comprised of upper and lower parallel arms <b>16</b>, <b>18</b> pivotally mounted at a forward end to the transverse toolbar <b>12</b> and at their rearward end to the row unit frame <b>20</b>. The parallel linkage <b>14</b> permits each row unit <b>10</b> to move vertically independently of the toolbar <b>12</b> and independently of the other spaced row units in order to accommodate changes in terrain or upon the row unit encountering a rock or other obstruction as the planter is drawn through the field.</p>\n<p id=\"p-0017\" num=\"0016\" level=\"\">The row unit frame <b>20</b> operably supports a seed hopper <b>22</b>, and a smaller hopper <b>24</b> for insecticide and/or fertilizer, a seed meter <b>26</b> and a seed tube <b>28</b> as well as a furrow opener assembly <b>30</b> and furrow closing assembly <b>40</b>. The furrow opening assembly <b>30</b> comprises a pair of furrow opener discs <b>32</b> and a pair of gauge wheels <b>34</b>. The gauge wheels <b>34</b> are pivotally secured to the row unit frame <b>20</b> by gauge wheel arms <b>36</b>. A furrow depth adjusting member <b>38</b> adjustably positions the gauge wheels <b>34</b> relative to the furrow opener discs <b>32</b> for establishing the desired furrow depth. A coil spring <b>50</b> is disposed between the parallel arms <b>16</b>, <b>18</b> to provide supplemental downforce to ensure that the furrow opener discs <b>32</b> fully penetrate the soil to the desired depth as set by the depth adjusting member <b>38</b> and to provide soil compaction for proper furrow formation. Rather than a coil spring, supplemental downforce may be provided by actuators or other suitable means such as disclosed in U.S. Pat. No. 6,389,999 to Duello, U.S. Pat. No. 6,701,857 to Jensen, in European Patent No. EP0372901 to Baker, and/or the Sauder '710 Application.</p>\n<p id=\"p-0018\" num=\"0017\" level=\"\">In operation, as the row unit <b>10</b> is lowered to the planting position, the opener discs <b>32</b> penetrate into the soil. At the same time, the soil forces the gauge wheels <b>34</b> to pivot upwardly until the gauge wheel arms <b>36</b> abut or come into contact with the stop position previously set with furrow depth adjusting member <b>38</b> or until a static load balance is achieved between the vertical load of the row unit and the reaction of the soil. As the planter is drawn forwardly in the direction indicated by arrow <b>39</b>, the furrow opener discs cut a V-shaped furrow <b>60</b> into the soil while the gauge wheels <b>34</b> compact the soil to aid in formation of the V-shaped furrow. Individual seeds <b>62</b> from the seed hopper <b>22</b> are dispensed by the seed meter <b>26</b> into the seed tube <b>28</b> in uniformly spaced increments. The seed tube <b>28</b> directs the individual dispensed seeds <b>62</b> downwardly and rearwardly between the furrow opener discs <b>32</b> and into the bottom of the V-shaped furrow <b>60</b>. The furrow <b>60</b> is then covered with soil and lightly compacted by the furrow closing assembly <b>40</b>.</p>\n<p id=\"p-0019\" num=\"0018\" level=\"\"><a idref=\"FIG-2\" id=\"FR-0002\" class=\"figref\">FIG. 2</a> illustrates a side view of another embodiment of a conventional row unit <b>10</b> for a central-fill planter such as disclosed in U.S. Pat. No. 7,438,006, incorporated herein in its entirety by reference. As in the row unit embodiment of <a idref=\"FIG-1\" id=\"FR-0003\" class=\"figref\">FIG. 1</a>, the row unit embodiment of <a idref=\"FIG-2\" id=\"FR-0004\" class=\"figref\">FIG. 2</a> includes a parallel arm linkage <b>14</b> comprised of upper and lower parallel arms <b>16</b>, <b>18</b> pivotally mounted at a forward end to the transverse toolbar <b>12</b> and at their rearward end to the row unit frame <b>20</b>. The row unit frame <b>20</b> supports a mini seed hopper <b>23</b>, seed meter <b>26</b>, a seed tube <b>28</b>, as well as the furrow opener assembly <b>30</b>, comprising a furrow opener discs <b>32</b> and gauge wheels <b>34</b>. The gauge wheels <b>34</b> are pivotally secured to the row unit frame <b>20</b> by gauge wheel arms <b>36</b>. Unlike the embodiment of <a idref=\"FIG-1\" id=\"FR-0005\" class=\"figref\">FIG. 1</a>, the gauge wheel arms <b>36</b> in the embodiment of <a idref=\"FIG-2\" id=\"FR-0006\" class=\"figref\">FIG. 2</a> extend forwardly of the gauge wheels <b>34</b>.</p>\n<p id=\"p-0020\" num=\"0019\" level=\"\">The row units <b>10</b> in <a idref=\"FIG-3,FIG-4\" id=\"FR-0007\" class=\"figref\">FIGS. 3 and 4</a> are substantially the same as the row units <b>10</b> depicted in <a idref=\"FIG-1,FIG-2\" id=\"FR-0008\" class=\"figref\">FIGS. 1 and 2</a>, respectively, except that in <a idref=\"FIG-3,FIG-4\" id=\"FR-0009\" class=\"figref\">FIGS. 3 and 4</a>, the coil springs <b>50</b> have been removed and replaced with an embodiment of a dynamic supplemental downforce control system <b>100</b> in accordance with the present invention.</p>\n<p id=\"p-0021\" num=\"0020\" level=\"\"><a idref=\"FIG-5\" id=\"FR-0010\" class=\"figref\">FIG. 5</a> schematically illustrates a preferred embodiment of the automated supplemental downforce control system <b>100</b> which comprises a closed-loop feedback circuit <b>110</b> that cooperates with a downforce actuator <b>200</b>. Preferably, the dynamic system <b>100</b> utilizes the hydraulic system of the tractor pulling the planter and therefore preferably comprises an electro-hydraulic closed-loop feedback circuit <b>110</b> and a dual action hydraulic cylinder <b>200</b>. However, the dynamic system <b>100</b> may be equally adapted for use with pneumatic actuators in cooperation with any corresponding electro-pneumatic closed-loop feedback circuit. It should also be appreciated that although the schematic illustration of <a idref=\"FIG-5\" id=\"FR-0011\" class=\"figref\">FIG. 5</a> shows the dynamic system <b>100</b> in relation to a four-row planters, the dynamic system <b>100</b> can be adapted to a planter with any number of row units.</p>\n<p id=\"p-0022\" num=\"0021\" level=\"\">As used herein, the term “actual gauge wheel downforce” Fa (<a idref=\"FIG-3,FIG-4\" id=\"FR-0012\" class=\"figref\">FIGS. 3 and 4</a>) refers to the dead load, live load and supplemental downforce transferred to the soil through the gauge wheels <b>34</b> of the row unit <b>10</b>. The row unit dead load is understood to be the mass of the entire row unit and any accessories mounted thereon. Therefore, the row unit dead load remains substantially constant and would include the mass of the row unit frame <b>20</b>, the furrow opening assembly <b>30</b>, the furrow closing assembly <b>40</b>, the hoppers <b>22</b>, <b>24</b>, seed meter <b>26</b>, seed tube <b>28</b> and the mass of any other attachments or devices operably supported or carried by the row unit frame. The row unit live load is understood to be the mass of the seed, insecticide and/or fertilizer within the hoppers <b>22</b>, <b>24</b>, <b>23</b> of the row unit or otherwise carried by the row unit. The live load typically varies as the material is dispensed during planting operations.</p>\n<p id=\"p-0023\" num=\"0022\" level=\"\">The term “supplemental downforce,” as used herein refers to the loading, other than the live load and dead load, that is applied to the row unit to force the row unit downwardly or upwardly relative to the toolbar <b>12</b> to achieve the desired furrow depth and soil compaction under the gauge wheels <b>34</b>. It should be understood that the supplemental downforce may increase or decrease the actual gauge wheel downforce Fa. It is recognized that a certain amount of the row unit dead load, live load and supplemental downforce is carried by the furrow opener discs <b>32</b> and the furrow closing assembly <b>40</b>. Nevertheless, because the preferred system and method <b>100</b> disclosed herein preferably involves only the forces or loads exerted on or transferred by the gauge wheels, then loads transferred by the opener discs and closing wheel need not be considered.</p>\n<p id=\"p-0024\" num=\"0023\" level=\"\">Referring to <a idref=\"FIG-3,FIG-4\" id=\"FR-0013\" class=\"figref\">FIGS. 3 and 4</a>, it should be appreciated that if the downforce actuator <b>200</b> is extended, the row unit <b>10</b> will be forced downwardly relative to toolbar <b>12</b>, resulting in an increase in the supplemental downforce and a corresponding increase in the actual gauge wheel downforce Fa. Likewise, if the downforce actuator <b>200</b> is retracted, the row unit <b>10</b> will be pulled upwardly relative to the toolbar <b>12</b>, resulting in a decrease in the supplemental downforce and a corresponding reduction in the actual gauge wheel downforce Fa.</p>\n<p id=\"p-0025\" num=\"0024\" level=\"\">Referring to <a idref=\"FIG-5\" id=\"FR-0014\" class=\"figref\">FIG. 5</a>, the preferred electro-hydraulic closed-loop feedback circuit <b>110</b> comprises a control module <b>112</b>, a pilot pressure control valve <b>114</b>, one load sensor <b>116</b> (preferably one per row unit), at least one direction control valve <b>140</b> (preferably one per row unit), fluid lines <b>122</b> and signal lines <b>124</b>. As described in greater detail later, a lever <b>136</b> (<a idref=\"FIG-3,FIG-4\" id=\"FR-0015\" class=\"figref\">FIGS. 3 and 4</a>) is preferably disposed to transmit the up and down directional displacement of the gauge wheels and thus the corresponding actual gauge wheel downforce Fa, to the direction control valve <b>140</b>. The signal lines <b>124</b> communicate electrical signals between the control module <b>112</b>, the load sensor <b>116</b>, the pilot pressure valve <b>114</b>, and the direction control valve <b>140</b>. The fluid lines communicate hydraulic fluid between a fluid source <b>130</b>, the pilot pressure control valve <b>114</b>, the direction control valve <b>140</b> and the downforce actuator <b>200</b>. The fluid source <b>130</b> is preferably the hydraulic fluid reservoir of the tractor pulling the planter. It should be appreciated that if the dynamic system <b>100</b> is an electro-pneumatic system, the fluid source may be an air compressor, compressed air tank or other suitable air source.</p>\n<p id=\"p-0026\" num=\"0025\" level=\"\">In general, through the control module <b>112</b>, the operator is able to set the desired gauge wheel downforce Fd, which, in one embodiment, corresponds to the output pressure of the pilot pressure control valve <b>114</b>. The control module <b>112</b> also preferably permits the operator to view the actual gauge wheel downforce Fa of the row units <b>10</b> as detected by the load sensors <b>116</b>. The direction control valve <b>140</b> permits fluid flow to and from the individual downforce actuators <b>200</b> in response to any imbalance between the desired gauge wheel downforce Fd acting at one end of the direction control valves <b>140</b> against the actual gauge wheel downforce Fa acting at the other end of the direction control valves <b>140</b>. Thus, the dynamic system <b>100</b> independently and dynamically adjusts the supplemental downforce for each individual row unit as each row unit experiences unique loading conditions during planting operations. The downforce adjustment occurs without the need for complex and expensive central processing circuitry or software programming that would otherwise be required to simultaneously monitor and compare the desired gauge wheel downforce Fd with the actual gauge wheel downforce Fa across all row units and to then send signals to independently control the downforce actuators <b>200</b> at each row unit.</p>\n<p id=\"p-0027\" num=\"0026\" level=\"\">Although it is preferable for each row unit <b>10</b> to have separate load sensor <b>116</b> so the operator can monitor the actual gauge wheel downforce for each row, it may be desirable to have load sensors on only certain row units, such as on the outside row units and one or two inner row units. It should also be appreciated that although it is desirable for each row unit <b>10</b> to have a direction control valve <b>140</b>, a single direction control valve <b>140</b> may be used to control fluid flow to the downforce actuators <b>200</b> of multiple row units. Similarly a single downforce actuator <b>200</b> may be utilized to control the supplemental downforce across multiple row units.</p>\n<p id=\"p-0028\" num=\"0027\" level=\"\">The pilot pressure control valve <b>114</b> is in fluid communication with the fluid source <b>130</b> via fluid lines <b>122</b>a and the direction control valve <b>140</b> via fluid lines <b>122</b>b. It is also in electrical communication with the control module <b>112</b> via signal lines <b>124</b>a. The operator is able to set the desired output pressure of the pilot pressure control valve <b>114</b> via the control module <b>112</b>. Suitable pilot pressure control valves include solenoid-operated proportional valves such as model no. PV72-21 distributed by HydraForce, Inc. in Lincolnshire, Ill.</p>\n<p id=\"p-0029\" num=\"0028\" level=\"\">The load sensor <b>116</b> is disposed to preferably generate an electrical signal corresponding to the actual gauge wheel downforce Fa (<a idref=\"FIG-3,FIG-5\" id=\"FR-0016\" class=\"figref\">FIGS. 3-5</a>). The control module <b>112</b> receives the generated signal from the load sensor <b>116</b> via the signal lines <b>124</b>b and preferably displays to the operator the actual gauge wheel downforce Fa corresponding to the generated signal. In a preferred embodiment, the load sensor <b>116</b> is a strain gauge such as a Wheatstone bridge circuit mounted in any suitable location from which the actual gauge wheel downforce Fa can be reasonably accurately determined. For example, the load sensor <b>116</b> may be mounted to detect the strain in the gauge wheel arm <b>36</b> (<a idref=\"FIG-4,FIG-5\" id=\"FR-0017\" class=\"figref\">FIGS. 4 and 5</a>) such as disclosed in U.S. Pat. No. 6,389,999 to Duello, or U.S. Pat. No. 6,701,857 to Jensen, or the strain in the pivot pin of the depth adjusting member <b>38</b> (<a idref=\"FIG-3\" id=\"FR-0018\" class=\"figref\">FIG. 3</a>), such as disclosed in the Sauder '253 Application, or in the equalizer for the depth adjusting member as disclosed in U.S. Provisional Application No. 60/883,957 filed Jan. 8, 2008 by Sauder et al., or in a location such as disclosed in European Patent No. EP0372901 to Baker. All of the above-referenced patents and/or patent applications are incorporated herein in their entireties by reference.</p>\n<p id=\"p-0030\" num=\"0029\" level=\"\">The control module <b>112</b> is preferably integrated into an existing planter monitor that provides a user interface, such as a touch screen, keypad or other input means, through which the operator can select or input the desired gauge wheel downforce Fd. The control module <b>112</b> is also preferably integrated into an existing planter monitor that provides a display screen or other visual display through which the operator can view and monitor the actual gauge wheel downforce Fa of the row units. In a preferred embodiment, the control module <b>112</b> is integrated into the 20/20® planter monitor system sold by Precision Planting, Inc., of Tremont, Ill. and as disclosed in U.S. patent application Ser. No. 12/522,252 (Pub. No. US2010/0010667) by Sauder et al., incorporated herein in its entirety by reference. Those skilled in the art would readily understand how to modify the 20/20® planter monitor or any other planter monitor to integrate the additional programming and circuitry necessary to allow an operator to input a desired gauge wheel downforce Fd for controlling the output of the pilot pressure valve <b>114</b> and to also receive and display the actual gauge wheel downforce Fa as detected by the load sensor <b>116</b>. Alternatively, as would be recognized by those skilled in the art, the control module <b>112</b> may be a standalone system incorporating the necessary circuitry for controlling the output pressure of the pilot control valve <b>114</b> corresponding to the desired gauge wheel downforce Fd, and/or for displaying the actual gauge wheel downforce Fa of the row units. Regardless of whether the control module <b>112</b> is integrated into an existing planter monitor system or as a standalone unit, it is preferably mounted in the cab of the tractor in a location where an operator can view and interact with the user interface during planting operations.</p>\n<p id=\"p-0031\" num=\"0030\" level=\"\">Referring to <a idref=\"\" id=\"FR-0019\" class=\"figref\">FIGS. 6 and 7A-7C</a>, the direction control valve <b>140</b> is preferably a three-position directional control valve similar such as model no. PTS16-12 distributed by Eaton Corporation, Eden Prairie, Minn. The direction control valve <b>140</b> preferably includes a housing <b>142</b> having an axial through-bore <b>144</b> and an enlarged counterbore <b>146</b>. A series of ports extend transversely through the sidewall <b>148</b> of the housing <b>142</b> and into the axial through-bore <b>144</b>, preferably including an inlet port <b>150</b>, first and second fluid return ports <b>152</b>, <b>154</b>, and first and second actuator ports <b>156</b>, <b>158</b>. A spool <b>160</b> is slidably disposed within the housing <b>142</b>. The spool <b>160</b> has a shaft <b>162</b> and an enlarged head <b>164</b>. The enlarged head <b>164</b> is disposed within the counterbore <b>146</b>. A spring <b>166</b> biases the spool head <b>164</b> leftward as viewed in <a idref=\"FIG-6\" id=\"FR-0020\" class=\"figref\">FIG. 6</a>. The shaft <b>162</b> includes two longitudinally spaced circumferential rings <b>168</b>. The circumferential rings <b>168</b> define raised surfaces, which, when aligned with the first and second actuator ports <b>156</b>, <b>158</b> as shown in <a idref=\"FIG-6\" id=\"FR-0021\" class=\"figref\">FIG. 6</a> effectively block the flow of fluid into or out of the ports and prevent passage of fluid from one side of the circumferential ring to the other. Thus, as illustrated in <a idref=\"FIG-7A,FIG-7C\" id=\"FR-0022\" class=\"figref\">FIGS. 7A-7C</a>, the movement of the spool <b>160</b> within the through-bore <b>144</b> functions as a three position valve. The direction control valve <b>140</b> further includes a head cap <b>170</b> and an end cap <b>172</b>. The head cap <b>170</b> includes an axial end port <b>174</b> in fluid communication with an axial counterbore <b>176</b>. A block <b>178</b> is slidably disposed within the axial counterbore <b>176</b> and abuts the spring biased spool head <b>164</b>. The end cap <b>172</b> has an axial bore <b>180</b> through which the distal end of the spool shaft <b>162</b> extends. O-rings <b>182</b> are provided to fluidly seal the head cap <b>170</b> and end cap <b>172</b> with the housing <b>142</b>.</p>\n<p id=\"p-0032\" num=\"0031\" level=\"\">In operation, referring to <a idref=\"\" id=\"FR-0023\" class=\"figref\">FIGS. 5, 6 and 7A-7C</a>, fluid lines <b>122</b>b communicate fluid from the pilot pressure valve <b>114</b> to the axial end port <b>174</b> of the direction control valves <b>140</b> at a pressure corresponding to the desired gauge wheel downforce Fd. Another set of fluid lines <b>122</b>c communicate pressurized fluid from the fluid pressure source <b>130</b> to the inlet port <b>150</b> of each direction control valve <b>140</b>. Another set of fluid lines <b>122</b>d communicate fluid between the fluid return ports <b>152</b>, <b>154</b> back to the fluid source <b>130</b>. Another set of fluid lines <b>122</b>e communicate fluid between the first and second actuator ports <b>156</b>, <b>158</b> to each side of the piston <b>202</b> within the downforce actuator <b>200</b> of each row unit <b>10</b>. The lever <b>136</b> (<a idref=\"FIG-3,FIG-4\" id=\"FR-0024\" class=\"figref\">FIGS. 3 and 4</a>) transmits the opposing actual gauge wheel downforce Fa to the distal end of the spool shaft <b>162</b> of the direction control valve <b>140</b>.</p>\n<p id=\"p-0033\" num=\"0032\" level=\"\">As depicted in <a idref=\"FIG-7A\" id=\"FR-0025\" class=\"figref\">FIG. 7A</a>, if the desired gauge wheel downforce Fd is the same as the actual gauge wheel downforce Fa transmitted by the lever <b>136</b> (i.e., Fd=Fa), the circumferential rings <b>168</b> on the spool shaft <b>162</b> are preferably aligned with the first and second actuator ports <b>156</b>, <b>158</b> thereby preventing fluid flow to and from the downforce actuator <b>200</b>.</p>\n<p id=\"p-0034\" num=\"0033\" level=\"\">As depicted in <a idref=\"FIG-7B\" id=\"FR-0026\" class=\"figref\">FIG. 7B</a>, if the desired gauge wheel downforce Fd is greater than the actual gauge wheel downforce Fa transmitted by the lever <b>136</b> (i.e., Fd&gt;Fa), the spool shaft <b>162</b> will be forced to the right opening fluid communication between the fluid inlet port <b>150</b> and the second actuator port <b>158</b> and opening fluid communication between the first actuator port <b>156</b> and the first fluid return port <b>152</b> thereby allowing fluid to flow into the piston end of the downforce actuator <b>200</b> and out through the rod end of the downforce actuator <b>200</b> forcing the piston <b>202</b> downwardly thereby increasing the actual gauge wheel downforce Fa. When the actual gauge wheel downforce Fa is sufficiently increased to rebalance with the desired gauge wheel downforce Fd, the spool shaft <b>162</b> will return to the position as show in <a idref=\"FIG-7A\" id=\"FR-0027\" class=\"figref\">FIG. 7A</a>.</p>\n<p id=\"p-0035\" num=\"0034\" level=\"\">As depicted in <a idref=\"FIG-7C\" id=\"FR-0028\" class=\"figref\">FIG. 7C</a>, if the desired gauge wheel downforce Fd is less than the actual gauge wheel downforce Fa transmitted by the lever <b>136</b> (i.e., Fd&lt;Fa), the spool shaft <b>162</b> will be forced to the left opening fluid communication between the fluid inlet port <b>150</b> and the first actuator port <b>156</b> and opening fluid communication between the second actuator port <b>158</b> and the second fluid return port <b>154</b> thereby allowing fluid to flow into the rod end of the downforce actuator <b>200</b> and out through the piston end of the downforce actuator <b>200</b> forcing the piston <b>202</b> upwardly thereby decreasing the actual gauge wheel downforce Fa. When the actual gauge wheel downforce Fa is sufficiently decreased to rebalance with the desired gauge wheel downforce Fd, the spool shaft <b>162</b> will return to the position as shown in <a idref=\"FIG-7A\" id=\"FR-0029\" class=\"figref\">FIG. 7A</a>.</p>\n<p id=\"p-0036\" num=\"0035\" level=\"\">It should be understood that instead of a system that utilizes a pilot pressure control valve <b>114</b> to transmit the desired gauge wheel downforce Fd to the direction control valve <b>140</b>, any suitable electrical or electro-mechanical device may be used to transmit the desired gauge wheel downforce Fd to the direction control valve <b>140</b>. For example, as illustrated in <a idref=\"FIG-8A,FIG-8C\" id=\"FR-0030\" class=\"figref\">FIGS. 8A-8C</a>, a solenoid <b>400</b> may be employed to transmit the desired gauge wheel downforce Fd against spool head <b>164</b>. In such an embodiment, the control module <b>112</b> would send an electrical signal to the solenoid <b>400</b> to cause the solenoid plunger <b>402</b> to be displaced corresponding to the desired gauge wheel downforce Fd which in turn acts upon the spool head <b>164</b> causing the corresponding displacement of the spool <b>160</b> to open and close the ports as described and illustrated in connection with <a idref=\"FIG-7A,FIG-7B\" id=\"FR-0031\" class=\"figref\">FIGS. 7A-7B</a>.</p>\n<p id=\"p-0037\" num=\"0036\" level=\"\">It should also be understood that the term “direction control valve” <b>140</b> should not be construed as being limited to the embodiment described and illustrated herein, but should instead be understood to include any device or combination of devices that allows fluid flow to and/or from the downforce actuator <b>200</b> when the actual gauge wheel downforce Fa becomes imbalanced with the desired gauge wheel downforce Fd.</p>\n<p id=\"p-0038\" num=\"0037\" level=\"\">Because the gauge wheels <b>34</b> may occasionally encounter rocks or other obstructions during planting operations that may cause high impact forces, the direction control valve <b>140</b> is preferably mounted in a manner to avoid damage from the impact forces. For example, the direction control valve <b>140</b> is preferably bias mounted to allow the control valve <b>140</b> to displace longitudinally if an abrupt force imposed by the lever <b>136</b> on the spool <b>160</b> causes the spool head <b>164</b> to bottom out against the head cap <b>170</b>. When the abrupt force is removed, the bias mount returns the direction control valve <b>140</b> to its normal position.</p>\n<p id=\"p-0039\" num=\"0038\" level=\"\">In a preferred embodiment, the control module <b>112</b> cooperates with a Global Positioning System (GPS) and is configured to access a desired downforce prescription map for setting and/or modifying the desired gauge wheel downforce Fd as the planter traverses the field. The downforce prescription map may be based upon soil types, elevations, or location-specific preferences set by the operator prior to operation. In such an embodiment, the control module <b>112</b> may be used to specify a different desired gauge wheel downforce Fd to each row unit or groups of row units to more accurately follow the downforce prescription map. For example, if the locations of the far right row unit and the far left row unit on the planter correspond to different prescribed desired gauge wheel downforces Fd based on soil type or other predefined factor, the control module <b>12</b> is preferably capable of setting the appropriate desired gauge wheel downforce Fd for each of the row units.</p>\n<p id=\"p-0040\" num=\"0039\" level=\"\">In addition, the control module <b>112</b> is preferably configured to determine and display a ground contact percentage as disclosed in applicant's co-pending international patent application no. PCT/US2008/050427 (Pub. No. WO2009/042238), which is incorporated herein in its entirety by reference. The control module <b>112</b> is preferably configured to allow the operator to select a desired minimum ground contact percentage in addition to, or rather than, inputting a specific desired gauge wheel downforce Fd. In such an embodiment, the desired gauge wheel downforce Fd would be the desired minimum ground contact percentage. The dynamic system <b>100</b> would adjust the supplemental downforce until the actual gauge wheel downforce Fa in relation to the desired gauge wheel downforce Fd resulted in the desired minimum ground contact percentage over the sampling period. Thus, as used herein, the term “desired gauge wheel downforce Fd” should be understood to include a force that may be expressed as a numerical value or as a percentage of ground contact.</p>\n<p id=\"p-0041\" num=\"0040\" level=\"\">The closed-loop feedback circuit <b>110</b> preferably cooperates with a transport position detector <b>300</b> (<a idref=\"FIG-5\" id=\"FR-0032\" class=\"figref\">FIG. 5</a>), such as a height sensor or contact switch disposed on the frame of the planter, to detect when the planter is raised into a transport position. It should be appreciated that when the planter is raised, the gauge wheel arms <b>36</b> will pivot downwardly resulting in the load sensor <b>116</b> to sense zero or near zero actual gauge wheel downforce Fa, which in turn will result in fluid flow to the downforce actuator <b>200</b> until it is fully extended. To prevent such a result from occurring, the transport position detector <b>300</b> is preferably in electrical communication with a valve <b>310</b> disposed along the fluid supply line <b>122</b>c. When the detector <b>300</b> detects that the planter is in a transport position, the valve <b>310</b> is closed to prevent the flow of fluid from the fluid source <b>130</b> to the fluid inlet ports <b>150</b> of the direction control valves <b>140</b> of the row units <b>10</b>. The valve <b>310</b> is preferably a two-position normally open solenoid valve.</p>\n<p id=\"p-0042\" num=\"0041\" level=\"\">Alternatively, instead of a separate valve <b>310</b> disposed in the fluid supply line <b>122</b>c, the transport position detector <b>300</b> may be in electrical communication with the pilot pressure control valve <b>114</b> such that when the planter is raised into the transport position, the transport position detector <b>300</b> sends a signal to cause the pilot pressure control valve <b>114</b> to close. In such an event the downforce actuators <b>200</b> will automatically “raise” in an effort to rebalance the load between Fd and Fa, by allowing fluid to flow through the direction control valve <b>140</b> as indicated in <a idref=\"\" id=\"FR-0033\" class=\"figref\">FIG. 7C or 8C</a>, because Fd will be zero when the pilot pressure control valve <b>114</b> is closed. When the load sensor <b>116</b> senses zero when the gauge wheels are raised above the soil such that Fd=Fa, the direction control valve <b>140</b> will return to the position illustrated in <a idref=\"\" id=\"FR-0034\" class=\"figref\">FIG. 7A or 8A</a> preventing fluid flow to the downforce actuator <b>200</b>.</p>\n<p id=\"p-0043\" num=\"0042\" level=\"\">Furthermore, it should be understood that the pilot pressure control valve <b>114</b> and the control module <b>112</b> may be combined into a single manually operated pressure regulating valve. In such an embodiment, the manually operated pressure regulating valve would preferably include labels or markers relating each pressure setting to the gauge wheel reaction force. In the same embodiment, the output pilot pressures corresponding to the desired gauge wheel downforce Fd would also be set manually. Such an embodiment is shown in <a idref=\"FIG-9\" id=\"FR-0035\" class=\"figref\">FIG. 9</a>, which illustrates a portion of the closed-loop feedback circuit <b>110</b> wherein control module <b>112</b> and the pilot pressure valve <b>114</b> are replaced by a manually operated pressure regulating valve <b>400</b>. The valve <b>400</b> includes a controller <b>402</b> such as a dial or knob, and settings <b>404</b> corresponding to the desired gauge wheel downforce Fd, which may be indicated in pounds force as illustrated or in any other desired units.</p>\n<p id=\"p-0044\" num=\"0043\" level=\"\">In another embodiment, the load sensor <b>116</b> may include a piezoelectric load cell such as a compression load cell model no. FSH00402 available from Futek in Irvine, Calif., which may be disposed between the direction control valve <b>140</b> and the lever <b>136</b>. Such an embodiment is illustrated in <a idref=\"FIG-10\" id=\"FR-0036\" class=\"figref\">FIG. 10</a>, in which a load cell <b>116</b> is mounted to the distal end of the spool shaft <b>162</b> of the direction control valve <b>140</b>.</p>\n<p id=\"p-0045\" num=\"0044\" level=\"\">The foregoing description is presented to enable one of ordinary skill in the art to make and use the invention and is provided in the context of a patent application and its requirements. Various modifications to the preferred embodiment of the apparatus, and the general principles and features of the system and methods described herein will be readily apparent to those of skill in the art. Thus, the present invention is not to be limited to the embodiments of the apparatus, system and methods described above and illustrated in the drawing figures, but is to be accorded the widest scope consistent with the spirit and scope of the appended claims.</p>\n",
            "plain": "\nDESCRIPTION\n\nReferring now to the drawings, wherein like reference numerals designate identical or corresponding parts throughout the several views, Patent-Figure illustrates a side elevation view of a single row unit 10 of a conventional row crop planter such as the type disclosed in U.S. Pat. No. 4,009,668, incorporated herein in its entirety by reference. As is well known in the art, the row units 10 are mounted in spaced relation along the length of a transverse toolbar 12 by a parallel linkage 14, comprised of upper and lower parallel arms 16, 18 pivotally mounted at a forward end to the transverse toolbar 12 and at their rearward end to the row unit frame 20. The parallel linkage 14 permits each row unit 10 to move vertically independently of the toolbar 12 and independently of the other spaced row units in order to accommodate changes in terrain or upon the row unit encountering a rock or other obstruction as the planter is drawn through the field.\n\nThe row unit frame 20 operably supports a seed hopper 22, and a smaller hopper 24 for insecticide and/or fertilizer, a seed meter 26 and a seed tube 28 as well as a furrow opener assembly 30 and furrow closing assembly 40. The furrow opening assembly 30 comprises a pair of furrow opener discs 32 and a pair of gauge wheels 34. The gauge wheels 34 are pivotally secured to the row unit frame 20 by gauge wheel arms 36. A furrow depth adjusting member 38 adjustably positions the gauge wheels 34 relative to the furrow opener discs 32 for establishing the desired furrow depth. A coil spring 50 is disposed between the parallel arms 16, 18 to provide supplemental downforce to ensure that the furrow opener discs 32 fully penetrate the soil to the desired depth as set by the depth adjusting member 38 and to provide soil compaction for proper furrow formation. Rather than a coil spring, supplemental downforce may be provided by actuators or other suitable means such as disclosed in U.S. Pat. No. 6,389,999 to Duello, U.S. Pat. No. 6,701,857 to Jensen, in European Patent No. EP0372901 to Baker, and/or the Sauder '710 Application.\n\nIn operation, as the row unit 10 is lowered to the planting position, the opener discs 32 penetrate into the soil. At the same time, the soil forces the gauge wheels 34 to pivot upwardly until the gauge wheel arms 36 abut or come into contact with the stop position previously set with furrow depth adjusting member 38 or until a static load balance is achieved between the vertical load of the row unit and the reaction of the soil. As the planter is drawn forwardly in the direction indicated by arrow 39, the furrow opener discs cut a V-shaped furrow 60 into the soil while the gauge wheels 34 compact the soil to aid in formation of the V-shaped furrow. Individual seeds 62 from the seed hopper 22 are dispensed by the seed meter 26 into the seed tube 28 in uniformly spaced increments. The seed tube 28 directs the individual dispensed seeds 62 downwardly and rearwardly between the furrow opener discs 32 and into the bottom of the V-shaped furrow 60. The furrow 60 is then covered with soil and lightly compacted by the furrow closing assembly 40.\n\nPatent-Figure illustrates a side view of another embodiment of a conventional row unit 10 for a central-fill planter such as disclosed in U.S. Pat. No. 7,438,006, incorporated herein in its entirety by reference. As in the row unit embodiment of Patent-Figure, the row unit embodiment of Patent-Figure includes a parallel arm linkage 14 comprised of upper and lower parallel arms 16, 18 pivotally mounted at a forward end to the transverse toolbar 12 and at their rearward end to the row unit frame 20. The row unit frame 20 supports a mini seed hopper 23, seed meter 26, a seed tube 28, as well as the furrow opener assembly 30, comprising a furrow opener discs 32 and gauge wheels 34. The gauge wheels 34 are pivotally secured to the row unit frame 20 by gauge wheel arms 36. Unlike the embodiment of Patent-Figure, the gauge wheel arms 36 in the embodiment of Patent-Figure extend forwardly of the gauge wheels 34.\n\nThe row units 10 in Patent-Figure are substantially the same as the row units 10 depicted in Patent-Figure, respectively, except that in Patent-Figure, the coil springs 50 have been removed and replaced with an embodiment of a dynamic supplemental downforce control system 100 in accordance with the present invention.\n\nPatent-Figure schematically illustrates a preferred embodiment of the automated supplemental downforce control system 100 which comprises a closed-loop feedback circuit 110 that cooperates with a downforce actuator 200. Preferably, the dynamic system 100 utilizes the hydraulic system of the tractor pulling the planter and therefore preferably comprises an electro-hydraulic closed-loop feedback circuit 110 and a dual action hydraulic cylinder 200. However, the dynamic system 100 may be equally adapted for use with pneumatic actuators in cooperation with any corresponding electro-pneumatic closed-loop feedback circuit. It should also be appreciated that although the schematic illustration of Patent-Figure shows the dynamic system 100 in relation to a four-row planters, the dynamic system 100 can be adapted to a planter with any number of row units.\n\nAs used herein, the term “actual gauge wheel downforce” Fa (Patent-Figure) refers to the dead load, live load and supplemental downforce transferred to the soil through the gauge wheels 34 of the row unit 10. The row unit dead load is understood to be the mass of the entire row unit and any accessories mounted thereon. Therefore, the row unit dead load remains substantially constant and would include the mass of the row unit frame 20, the furrow opening assembly 30, the furrow closing assembly 40, the hoppers 22, 24, seed meter 26, seed tube 28 and the mass of any other attachments or devices operably supported or carried by the row unit frame. The row unit live load is understood to be the mass of the seed, insecticide and/or fertilizer within the hoppers 22, 24, 23 of the row unit or otherwise carried by the row unit. The live load typically varies as the material is dispensed during planting operations.\n\nThe term “supplemental downforce,” as used herein refers to the loading, other than the live load and dead load, that is applied to the row unit to force the row unit downwardly or upwardly relative to the toolbar 12 to achieve the desired furrow depth and soil compaction under the gauge wheels 34. It should be understood that the supplemental downforce may increase or decrease the actual gauge wheel downforce Fa. It is recognized that a certain amount of the row unit dead load, live load and supplemental downforce is carried by the furrow opener discs 32 and the furrow closing assembly 40. Nevertheless, because the preferred system and method 100 disclosed herein preferably involves only the forces or loads exerted on or transferred by the gauge wheels, then loads transferred by the opener discs and closing wheel need not be considered.\n\nReferring to Patent-Figure, it should be appreciated that if the downforce actuator 200 is extended, the row unit 10 will be forced downwardly relative to toolbar 12, resulting in an increase in the supplemental downforce and a corresponding increase in the actual gauge wheel downforce Fa. Likewise, if the downforce actuator 200 is retracted, the row unit 10 will be pulled upwardly relative to the toolbar 12, resulting in a decrease in the supplemental downforce and a corresponding reduction in the actual gauge wheel downforce Fa.\n\nReferring to Patent-Figure, the preferred electro-hydraulic closed-loop feedback circuit 110 comprises a control module 112, a pilot pressure control valve 114, one load sensor 116 (preferably one per row unit), at least one direction control valve 140 (preferably one per row unit), fluid lines 122 and signal lines 124. As described in greater detail later, a lever 136 (Patent-Figure) is preferably disposed to transmit the up and down directional displacement of the gauge wheels and thus the corresponding actual gauge wheel downforce Fa, to the direction control valve 140. The signal lines 124 communicate electrical signals between the control module 112, the load sensor 116, the pilot pressure valve 114, and the direction control valve 140. The fluid lines communicate hydraulic fluid between a fluid source 130, the pilot pressure control valve 114, the direction control valve 140 and the downforce actuator 200. The fluid source 130 is preferably the hydraulic fluid reservoir of the tractor pulling the planter. It should be appreciated that if the dynamic system 100 is an electro-pneumatic system, the fluid source may be an air compressor, compressed air tank or other suitable air source.\n\nIn general, through the control module 112, the operator is able to set the desired gauge wheel downforce Fd, which, in one embodiment, corresponds to the output pressure of the pilot pressure control valve 114. The control module 112 also preferably permits the operator to view the actual gauge wheel downforce Fa of the row units 10 as detected by the load sensors 116. The direction control valve 140 permits fluid flow to and from the individual downforce actuators 200 in response to any imbalance between the desired gauge wheel downforce Fd acting at one end of the direction control valves 140 against the actual gauge wheel downforce Fa acting at the other end of the direction control valves 140. Thus, the dynamic system 100 independently and dynamically adjusts the supplemental downforce for each individual row unit as each row unit experiences unique loading conditions during planting operations. The downforce adjustment occurs without the need for complex and expensive central processing circuitry or software programming that would otherwise be required to simultaneously monitor and compare the desired gauge wheel downforce Fd with the actual gauge wheel downforce Fa across all row units and to then send signals to independently control the downforce actuators 200 at each row unit.\n\nAlthough it is preferable for each row unit 10 to have separate load sensor 116 so the operator can monitor the actual gauge wheel downforce for each row, it may be desirable to have load sensors on only certain row units, such as on the outside row units and one or two inner row units. It should also be appreciated that although it is desirable for each row unit 10 to have a direction control valve 140, a single direction control valve 140 may be used to control fluid flow to the downforce actuators 200 of multiple row units. Similarly a single downforce actuator 200 may be utilized to control the supplemental downforce across multiple row units.\n\nThe pilot pressure control valve 114 is in fluid communication with the fluid source 130 via fluid lines 122a and the direction control valve 140 via fluid lines 122b. It is also in electrical communication with the control module 112 via signal lines 124a. The operator is able to set the desired output pressure of the pilot pressure control valve 114 via the control module 112. Suitable pilot pressure control valves include solenoid-operated proportional valves such as model no. PV72-21 distributed by HydraForce, Inc. in Lincolnshire, Ill.\n\nThe load sensor 116 is disposed to preferably generate an electrical signal corresponding to the actual gauge wheel downforce Fa (Patent-Figure). The control module 112 receives the generated signal from the load sensor 116 via the signal lines 124b and preferably displays to the operator the actual gauge wheel downforce Fa corresponding to the generated signal. In a preferred embodiment, the load sensor 116 is a strain gauge such as a Wheatstone bridge circuit mounted in any suitable location from which the actual gauge wheel downforce Fa can be reasonably accurately determined. For example, the load sensor 116 may be mounted to detect the strain in the gauge wheel arm 36 (Patent-Figure) such as disclosed in U.S. Pat. No. 6,389,999 to Duello, or U.S. Pat. No. 6,701,857 to Jensen, or the strain in the pivot pin of the depth adjusting member 38 (Patent-Figure), such as disclosed in the Sauder '253 Application, or in the equalizer for the depth adjusting member as disclosed in U.S. Provisional Application No. 60/883,957 filed Jan. 8, 2008 by Sauder et al., or in a location such as disclosed in European Patent No. EP0372901 to Baker. All of the above-referenced patents and/or patent applications are incorporated herein in their entireties by reference.\n\nThe control module 112 is preferably integrated into an existing planter monitor that provides a user interface, such as a touch screen, keypad or other input means, through which the operator can select or input the desired gauge wheel downforce Fd. The control module 112 is also preferably integrated into an existing planter monitor that provides a display screen or other visual display through which the operator can view and monitor the actual gauge wheel downforce Fa of the row units. In a preferred embodiment, the control module 112 is integrated into the 20/20® planter monitor system sold by Precision Planting, Inc., of Tremont, Ill. and as disclosed in U.S. patent application Ser. No. 12/522,252 (Pub. No. US2010/0010667) by Sauder et al., incorporated herein in its entirety by reference. Those skilled in the art would readily understand how to modify the 20/20® planter monitor or any other planter monitor to integrate the additional programming and circuitry necessary to allow an operator to input a desired gauge wheel downforce Fd for controlling the output of the pilot pressure valve 114 and to also receive and display the actual gauge wheel downforce Fa as detected by the load sensor 116. Alternatively, as would be recognized by those skilled in the art, the control module 112 may be a standalone system incorporating the necessary circuitry for controlling the output pressure of the pilot control valve 114 corresponding to the desired gauge wheel downforce Fd, and/or for displaying the actual gauge wheel downforce Fa of the row units. Regardless of whether the control module 112 is integrated into an existing planter monitor system or as a standalone unit, it is preferably mounted in the cab of the tractor in a location where an operator can view and interact with the user interface during planting operations.\n\nReferring to Patent-Figure, the direction control valve 140 is preferably a three-position directional control valve similar such as model no. PTS16-12 distributed by Eaton Corporation, Eden Prairie, Minn. The direction control valve 140 preferably includes a housing 142 having an axial through-bore 144 and an enlarged counterbore 146. A series of ports extend transversely through the sidewall 148 of the housing 142 and into the axial through-bore 144, preferably including an inlet port 150, first and second fluid return ports 152, 154, and first and second actuator ports 156, 158. A spool 160 is slidably disposed within the housing 142. The spool 160 has a shaft 162 and an enlarged head 164. The enlarged head 164 is disposed within the counterbore 146. A spring 166 biases the spool head 164 leftward as viewed in Patent-Figure. The shaft 162 includes two longitudinally spaced circumferential rings 168. The circumferential rings 168 define raised surfaces, which, when aligned with the first and second actuator ports 156, 158 as shown in Patent-Figure effectively block the flow of fluid into or out of the ports and prevent passage of fluid from one side of the circumferential ring to the other. Thus, as illustrated in Patent-Figure, the movement of the spool 160 within the through-bore 144 functions as a three position valve. The direction control valve 140 further includes a head cap 170 and an end cap 172. The head cap 170 includes an axial end port 174 in fluid communication with an axial counterbore 176. A block 178 is slidably disposed within the axial counterbore 176 and abuts the spring biased spool head 164. The end cap 172 has an axial bore 180 through which the distal end of the spool shaft 162 extends. O-rings 182 are provided to fluidly seal the head cap 170 and end cap 172 with the housing 142.\n\nIn operation, referring to Patent-Figure, fluid lines 122b communicate fluid from the pilot pressure valve 114 to the axial end port 174 of the direction control valves 140 at a pressure corresponding to the desired gauge wheel downforce Fd. Another set of fluid lines 122c communicate pressurized fluid from the fluid pressure source 130 to the inlet port 150 of each direction control valve 140. Another set of fluid lines 122d communicate fluid between the fluid return ports 152, 154 back to the fluid source 130. Another set of fluid lines 122e communicate fluid between the first and second actuator ports 156, 158 to each side of the piston 202 within the downforce actuator 200 of each row unit 10. The lever 136 (Patent-Figure) transmits the opposing actual gauge wheel downforce Fa to the distal end of the spool shaft 162 of the direction control valve 140.\n\nAs depicted in Patent-Figure, if the desired gauge wheel downforce Fd is the same as the actual gauge wheel downforce Fa transmitted by the lever 136 (i.e., Fd=Fa), the circumferential rings 168 on the spool shaft 162 are preferably aligned with the first and second actuator ports 156, 158 thereby preventing fluid flow to and from the downforce actuator 200.\n\nAs depicted in Patent-Figure, if the desired gauge wheel downforce Fd is greater than the actual gauge wheel downforce Fa transmitted by the lever 136 (i.e., Fd>Fa), the spool shaft 162 will be forced to the right opening fluid communication between the fluid inlet port 150 and the second actuator port 158 and opening fluid communication between the first actuator port 156 and the first fluid return port 152 thereby allowing fluid to flow into the piston end of the downforce actuator 200 and out through the rod end of the downforce actuator 200 forcing the piston 202 downwardly thereby increasing the actual gauge wheel downforce Fa. When the actual gauge wheel downforce Fa is sufficiently increased to rebalance with the desired gauge wheel downforce Fd, the spool shaft 162 will return to the position as show in Patent-Figure.\n\nAs depicted in Patent-Figure, if the desired gauge wheel downforce Fd is less than the actual gauge wheel downforce Fa transmitted by the lever 136 (i.e., Fd<Fa), the spool shaft 162 will be forced to the left opening fluid communication between the fluid inlet port 150 and the first actuator port 156 and opening fluid communication between the second actuator port 158 and the second fluid return port 154 thereby allowing fluid to flow into the rod end of the downforce actuator 200 and out through the piston end of the downforce actuator 200 forcing the piston 202 upwardly thereby decreasing the actual gauge wheel downforce Fa. When the actual gauge wheel downforce Fa is sufficiently decreased to rebalance with the desired gauge wheel downforce Fd, the spool shaft 162 will return to the position as shown in Patent-Figure.\n\nIt should be understood that instead of a system that utilizes a pilot pressure control valve 114 to transmit the desired gauge wheel downforce Fd to the direction control valve 140, any suitable electrical or electro-mechanical device may be used to transmit the desired gauge wheel downforce Fd to the direction control valve 140. For example, as illustrated in Patent-Figure, a solenoid 400 may be employed to transmit the desired gauge wheel downforce Fd against spool head 164. In such an embodiment, the control module 112 would send an electrical signal to the solenoid 400 to cause the solenoid plunger 402 to be displaced corresponding to the desired gauge wheel downforce Fd which in turn acts upon the spool head 164 causing the corresponding displacement of the spool 160 to open and close the ports as described and illustrated in connection with Patent-Figure.\n\nIt should also be understood that the term “direction control valve” 140 should not be construed as being limited to the embodiment described and illustrated herein, but should instead be understood to include any device or combination of devices that allows fluid flow to and/or from the downforce actuator 200 when the actual gauge wheel downforce Fa becomes imbalanced with the desired gauge wheel downforce Fd.\n\nBecause the gauge wheels 34 may occasionally encounter rocks or other obstructions during planting operations that may cause high impact forces, the direction control valve 140 is preferably mounted in a manner to avoid damage from the impact forces. For example, the direction control valve 140 is preferably bias mounted to allow the control valve 140 to displace longitudinally if an abrupt force imposed by the lever 136 on the spool 160 causes the spool head 164 to bottom out against the head cap 170. When the abrupt force is removed, the bias mount returns the direction control valve 140 to its normal position.\n\nIn a preferred embodiment, the control module 112 cooperates with a Global Positioning System (GPS) and is configured to access a desired downforce prescription map for setting and/or modifying the desired gauge wheel downforce Fd as the planter traverses the field. The downforce prescription map may be based upon soil types, elevations, or location-specific preferences set by the operator prior to operation. In such an embodiment, the control module 112 may be used to specify a different desired gauge wheel downforce Fd to each row unit or groups of row units to more accurately follow the downforce prescription map. For example, if the locations of the far right row unit and the far left row unit on the planter correspond to different prescribed desired gauge wheel downforces Fd based on soil type or other predefined factor, the control module 12 is preferably capable of setting the appropriate desired gauge wheel downforce Fd for each of the row units.\n\nIn addition, the control module 112 is preferably configured to determine and display a ground contact percentage as disclosed in applicant's co-pending international patent application no. PCT/US2008/050427 (Pub. No. WO2009/042238), which is incorporated herein in its entirety by reference. The control module 112 is preferably configured to allow the operator to select a desired minimum ground contact percentage in addition to, or rather than, inputting a specific desired gauge wheel downforce Fd. In such an embodiment, the desired gauge wheel downforce Fd would be the desired minimum ground contact percentage. The dynamic system 100 would adjust the supplemental downforce until the actual gauge wheel downforce Fa in relation to the desired gauge wheel downforce Fd resulted in the desired minimum ground contact percentage over the sampling period. Thus, as used herein, the term “desired gauge wheel downforce Fd” should be understood to include a force that may be expressed as a numerical value or as a percentage of ground contact.\n\nThe closed-loop feedback circuit 110 preferably cooperates with a transport position detector 300 (Patent-Figure), such as a height sensor or contact switch disposed on the frame of the planter, to detect when the planter is raised into a transport position. It should be appreciated that when the planter is raised, the gauge wheel arms 36 will pivot downwardly resulting in the load sensor 116 to sense zero or near zero actual gauge wheel downforce Fa, which in turn will result in fluid flow to the downforce actuator 200 until it is fully extended. To prevent such a result from occurring, the transport position detector 300 is preferably in electrical communication with a valve 310 disposed along the fluid supply line 122c. When the detector 300 detects that the planter is in a transport position, the valve 310 is closed to prevent the flow of fluid from the fluid source 130 to the fluid inlet ports 150 of the direction control valves 140 of the row units 10. The valve 310 is preferably a two-position normally open solenoid valve.\n\nAlternatively, instead of a separate valve 310 disposed in the fluid supply line 122c, the transport position detector 300 may be in electrical communication with the pilot pressure control valve 114 such that when the planter is raised into the transport position, the transport position detector 300 sends a signal to cause the pilot pressure control valve 114 to close. In such an event the downforce actuators 200 will automatically “raise” in an effort to rebalance the load between Fd and Fa, by allowing fluid to flow through the direction control valve 140 as indicated in Patent-Figure, because Fd will be zero when the pilot pressure control valve 114 is closed. When the load sensor 116 senses zero when the gauge wheels are raised above the soil such that Fd=Fa, the direction control valve 140 will return to the position illustrated in Patent-Figure preventing fluid flow to the downforce actuator 200.\n\nFurthermore, it should be understood that the pilot pressure control valve 114 and the control module 112 may be combined into a single manually operated pressure regulating valve. In such an embodiment, the manually operated pressure regulating valve would preferably include labels or markers relating each pressure setting to the gauge wheel reaction force. In the same embodiment, the output pilot pressures corresponding to the desired gauge wheel downforce Fd would also be set manually. Such an embodiment is shown in Patent-Figure, which illustrates a portion of the closed-loop feedback circuit 110 wherein control module 112 and the pilot pressure valve 114 are replaced by a manually operated pressure regulating valve 400. The valve 400 includes a controller 402 such as a dial or knob, and settings 404 corresponding to the desired gauge wheel downforce Fd, which may be indicated in pounds force as illustrated or in any other desired units.\n\nIn another embodiment, the load sensor 116 may include a piezoelectric load cell such as a compression load cell model no. FSH00402 available from Futek in Irvine, Calif., which may be disposed between the direction control valve 140 and the lever 136. Such an embodiment is illustrated in Patent-Figure, in which a load cell 116 is mounted to the distal end of the spool shaft 162 of the direction control valve 140.\n\nThe foregoing description is presented to enable one of ordinary skill in the art to make and use the invention and is provided in the context of a patent application and its requirements. Various modifications to the preferred embodiment of the apparatus, and the general principles and features of the system and methods described herein will be readily apparent to those of skill in the art. Thus, the present invention is not to be limited to the embodiments of the apparatus, system and methods described above and illustrated in the drawing figures, but is to be accorded the widest scope consistent with the spirit and scope of the appended claims.\n"
        }
    },
    "claims": [
        {
            "id": "CLM-00001",
            "type": "INDEPENDENT",
            "raw": "<claim id=\"CLM-00001\" num=\"00001\">\n<claim-text>1. A method of controlling supplemental downforce on a planter row unit, comprising:\n<claim-text>generating an actual gauge wheel downforce Fa on the planter row unit;</claim-text>\n<claim-text>defining a desired gauge wheel downforce Fd; and</claim-text>\n<claim-text>modifying said actual gauge wheel downforce Fa such that said actual gauge wheel downforce Fa becomes closer to said desired gauge wheel downforce Fd, wherein said step of modifying said actual gauge wheel downforce Fa is accomplished using a first fluid control apparatus, said fluid control apparatus being mounted to the planter row unit.</claim-text>\n</claim-text>\n</claim>",
            "normalized": "<p class=\"claim\" id=\"CLM-00001\">A method of controlling supplemental downforce on a planter row unit, comprising:\ngenerating an actual gauge wheel downforce Fa on the planter row unit;\ndefining a desired gauge wheel downforce Fd; and\nmodifying said actual gauge wheel downforce Fa such that said actual gauge wheel downforce Fa becomes closer to said desired gauge wheel downforce Fd, wherein said step of modifying said actual gauge wheel downforce Fa is accomplished using a first fluid control apparatus, said fluid control apparatus being mounted to the planter row unit.</p>",
            "plain": "A method of controlling supplemental downforce on a planter row unit, comprising: generating an actual gauge wheel downforce Fa on the planter row unit; defining a desired gauge wheel downforce Fd; and modifying said actual gauge wheel downforce Fa such that said actual gauge wheel downforce Fa becomes closer to said desired gauge wheel downforce Fd, wherein said step of modifying said actual gauge wheel downforce Fa is accomplished using a first fluid control apparatus, said fluid control apparatus being mounted to the planter row unit.",
            "claimTree": {
                "parentIds": [
                ],
                "parentCount": 0,
                "childIds": [
                    "CLM-00002",
                    "CLM-00014",
                    "CLM-00015"
                ],
                "childCount": 3,
                "claimTreelevel": 0
            }
        },
        {
            "id": "CLM-00002",
            "type": "DEPENDENT",
            "raw": "<claim id=\"CLM-00002\" num=\"00002\">\n<claim-text>2. The method of <claim-ref idref=\"CLM-00001\">claim 1</claim-ref>, wherein said first fluid control apparatus comprises a fluid control valve.</claim-text>\n</claim>",
            "normalized": "<p class=\"claim\" id=\"CLM-00002\" depends=\"CLM-00001\">The method of <a idref=\"CLM-00001\" id=\"CR-0001\" class=\"claim\">claim 1</a>, wherein said first fluid control apparatus comprises a fluid control valve.</p>",
            "plain": "The method of claim 1 <>, wherein said first fluid control apparatus comprises a fluid control valve.",
            "claimTree": {
                "parentIds": [
                    "CLM-00001"
                ],
                "parentCount": 1,
                "childIds": [
                    "CLM-00003",
                    "CLM-00005",
                    "CLM-00008",
                    "CLM-00009",
                    "CLM-00013"
                ],
                "childCount": 5,
                "claimTreelevel": 1
            }
        },
        {
            "id": "CLM-00003",
            "type": "DEPENDENT",
            "raw": "<claim id=\"CLM-00003\" num=\"00003\">\n<claim-text>3. The method of <claim-ref idref=\"CLM-00002\">claim 2</claim-ref>, wherein said step of modifying said actual gauge wheel downforce Fa is additionally accomplished using a second fluid control apparatus, said fluid control apparatus being mounted to the planter row unit.</claim-text>\n</claim>",
            "normalized": "<p class=\"claim\" id=\"CLM-00003\" depends=\"CLM-00002\">The method of <a idref=\"CLM-00002\" id=\"CR-0001\" class=\"claim\">claim 2</a>, wherein said step of modifying said actual gauge wheel downforce Fa is additionally accomplished using a second fluid control apparatus, said fluid control apparatus being mounted to the planter row unit.</p>",
            "plain": "The method of claim 2 <>, wherein said step of modifying said actual gauge wheel downforce Fa is additionally accomplished using a second fluid control apparatus, said fluid control apparatus being mounted to the planter row unit.",
            "claimTree": {
                "parentIds": [
                    "CLM-00002"
                ],
                "parentCount": 1,
                "childIds": [
                    "CLM-00004"
                ],
                "childCount": 1,
                "claimTreelevel": 2
            }
        },
        {
            "id": "CLM-00004",
            "type": "DEPENDENT",
            "raw": "<claim id=\"CLM-00004\" num=\"00004\">\n<claim-text>4. The method of <claim-ref idref=\"CLM-00003\">claim 3</claim-ref>, wherein said second fluid control apparatus comprises a fluid manifold, said fluid manifold having a plurality of fluid inputs and a plurality of fluid outputs.</claim-text>\n</claim>",
            "normalized": "<p class=\"claim\" id=\"CLM-00004\" depends=\"CLM-00003\">The method of <a idref=\"CLM-00003\" id=\"CR-0001\" class=\"claim\">claim 3</a>, wherein said second fluid control apparatus comprises a fluid manifold, said fluid manifold having a plurality of fluid inputs and a plurality of fluid outputs.</p>",
            "plain": "The method of claim 3 <>, wherein said second fluid control apparatus comprises a fluid manifold, said fluid manifold having a plurality of fluid inputs and a plurality of fluid outputs.",
            "claimTree": {
                "parentIds": [
                    "CLM-00003"
                ],
                "parentCount": 1,
                "childIds": [
                ],
                "childCount": 0,
                "claimTreelevel": 3
            }
        },
        {
            "id": "CLM-00005",
            "type": "DEPENDENT",
            "raw": "<claim id=\"CLM-00005\" num=\"00005\">\n<claim-text>5. The method of <claim-ref idref=\"CLM-00002\">claim 2</claim-ref>, further including:\n<claim-text>sending a command signal to a solenoid associated with said first fluid control apparatus, wherein in response to receipt of said command signal, said solenoid causes said fluid control apparatus to modify an operating state of said fluid control apparatus such that said actual gauge wheel downforce Fa becomes closer to said desired gauge wheel downforce Fd.</claim-text>\n</claim-text>\n</claim>",
            "normalized": "<p class=\"claim\" id=\"CLM-00005\" depends=\"CLM-00002\">The method of <a idref=\"CLM-00002\" id=\"CR-0001\" class=\"claim\">claim 2</a>, further including:\nsending a command signal to a solenoid associated with said first fluid control apparatus, wherein in response to receipt of said command signal, said solenoid causes said fluid control apparatus to modify an operating state of said fluid control apparatus such that said actual gauge wheel downforce Fa becomes closer to said desired gauge wheel downforce Fd.</p>",
            "plain": "The method of claim 2 <>, further including: sending a command signal to a solenoid associated with said first fluid control apparatus, wherein in response to receipt of said command signal, said solenoid causes said fluid control apparatus to modify an operating state of said fluid control apparatus such that said actual gauge wheel downforce Fa becomes closer to said desired gauge wheel downforce Fd.",
            "claimTree": {
                "parentIds": [
                    "CLM-00002"
                ],
                "parentCount": 1,
                "childIds": [
                    "CLM-00006"
                ],
                "childCount": 1,
                "claimTreelevel": 2
            }
        },
        {
            "id": "CLM-00006",
            "type": "DEPENDENT",
            "raw": "<claim id=\"CLM-00006\" num=\"00006\">\n<claim-text>6. The method of <claim-ref idref=\"CLM-00005\">claim 5</claim-ref>, wherein said step of modifying said actual gauge wheel downforce Fa is additionally accomplished using a second fluid control apparatus, said fluid control apparatus being mounted to the planter row unit.</claim-text>\n</claim>",
            "normalized": "<p class=\"claim\" id=\"CLM-00006\" depends=\"CLM-00005\">The method of <a idref=\"CLM-00005\" id=\"CR-0001\" class=\"claim\">claim 5</a>, wherein said step of modifying said actual gauge wheel downforce Fa is additionally accomplished using a second fluid control apparatus, said fluid control apparatus being mounted to the planter row unit.</p>",
            "plain": "The method of claim 5 <>, wherein said step of modifying said actual gauge wheel downforce Fa is additionally accomplished using a second fluid control apparatus, said fluid control apparatus being mounted to the planter row unit.",
            "claimTree": {
                "parentIds": [
                    "CLM-00005"
                ],
                "parentCount": 1,
                "childIds": [
                    "CLM-00007"
                ],
                "childCount": 1,
                "claimTreelevel": 3
            }
        },
        {
            "id": "CLM-00007",
            "type": "DEPENDENT",
            "raw": "<claim id=\"CLM-00007\" num=\"00007\">\n<claim-text>7. The method of <claim-ref idref=\"CLM-00006\">claim 6</claim-ref>, wherein said second fluid control apparatus comprises a fluid manifold, said fluid manifold having a plurality of fluid inputs and a plurality of fluid outputs.</claim-text>\n</claim>",
            "normalized": "<p class=\"claim\" id=\"CLM-00007\" depends=\"CLM-00006\">The method of <a idref=\"CLM-00006\" id=\"CR-0001\" class=\"claim\">claim 6</a>, wherein said second fluid control apparatus comprises a fluid manifold, said fluid manifold having a plurality of fluid inputs and a plurality of fluid outputs.</p>",
            "plain": "The method of claim 6 <>, wherein said second fluid control apparatus comprises a fluid manifold, said fluid manifold having a plurality of fluid inputs and a plurality of fluid outputs.",
            "claimTree": {
                "parentIds": [
                    "CLM-00006"
                ],
                "parentCount": 1,
                "childIds": [
                ],
                "childCount": 0,
                "claimTreelevel": 4
            }
        },
        {
            "id": "CLM-00008",
            "type": "DEPENDENT",
            "raw": "<claim id=\"CLM-00008\" num=\"00008\">\n<claim-text>8. The method of <claim-ref idref=\"CLM-00002\">claim 2</claim-ref>, further including:\n<claim-text>detecting that said planter row unit is in a transport position; and</claim-text>\n<claim-text>upon detecting that said planter row unit is in a transport position, modifying said desired gauge wheel downforce Fd.</claim-text>\n</claim-text>\n</claim>",
            "normalized": "<p class=\"claim\" id=\"CLM-00008\" depends=\"CLM-00002\">The method of <a idref=\"CLM-00002\" id=\"CR-0001\" class=\"claim\">claim 2</a>, further including:\ndetecting that said planter row unit is in a transport position; and\nupon detecting that said planter row unit is in a transport position, modifying said desired gauge wheel downforce Fd.</p>",
            "plain": "The method of claim 2 <>, further including: detecting that said planter row unit is in a transport position; and upon detecting that said planter row unit is in a transport position, modifying said desired gauge wheel downforce Fd.",
            "claimTree": {
                "parentIds": [
                    "CLM-00002"
                ],
                "parentCount": 1,
                "childIds": [
                ],
                "childCount": 0,
                "claimTreelevel": 2
            }
        },
        {
            "id": "CLM-00009",
            "type": "DEPENDENT",
            "raw": "<claim id=\"CLM-00009\" num=\"00009\">\n<claim-text>9. The method of <claim-ref idref=\"CLM-00002\">claim 2</claim-ref>, wherein said row unit is one of a plurality of row units each generating an actual gauge wheel downforce Fa during planting operations and wherein said valve is one of a plurality of valves, each of which is associated with and mounted to one of said plurality of row units, and wherein each of said plurality of valves is associated with one of a plurality of solenoids.</claim-text>\n</claim>",
            "normalized": "<p class=\"claim\" id=\"CLM-00009\" depends=\"CLM-00002\">The method of <a idref=\"CLM-00002\" id=\"CR-0001\" class=\"claim\">claim 2</a>, wherein said row unit is one of a plurality of row units each generating an actual gauge wheel downforce Fa during planting operations and wherein said valve is one of a plurality of valves, each of which is associated with and mounted to one of said plurality of row units, and wherein each of said plurality of valves is associated with one of a plurality of solenoids.</p>",
            "plain": "The method of claim 2 <>, wherein said row unit is one of a plurality of row units each generating an actual gauge wheel downforce Fa during planting operations and wherein said valve is one of a plurality of valves, each of which is associated with and mounted to one of said plurality of row units, and wherein each of said plurality of valves is associated with one of a plurality of solenoids.",
            "claimTree": {
                "parentIds": [
                    "CLM-00002"
                ],
                "parentCount": 1,
                "childIds": [
                    "CLM-00010"
                ],
                "childCount": 1,
                "claimTreelevel": 2
            }
        },
        {
            "id": "CLM-00010",
            "type": "DEPENDENT",
            "raw": "<claim id=\"CLM-00010\" num=\"00010\">\n<claim-text>10. The method of <claim-ref idref=\"CLM-00009\">claim 9</claim-ref>, wherein each of said plurality of valves adjusts a pressure in one of a plurality of downforce actuators in order to bring said actual gauge wheel downforce Fa closer to said desired gauge wheel downforce Fd at each row unit, each of said plurality of downforce actuators being disposed to modify said actual gauge wheel downforce Fa on one of said plurality of row units.</claim-text>\n</claim>",
            "normalized": "<p class=\"claim\" id=\"CLM-00010\" depends=\"CLM-00009\">The method of <a idref=\"CLM-00009\" id=\"CR-0001\" class=\"claim\">claim 9</a>, wherein each of said plurality of valves adjusts a pressure in one of a plurality of downforce actuators in order to bring said actual gauge wheel downforce Fa closer to said desired gauge wheel downforce Fd at each row unit, each of said plurality of downforce actuators being disposed to modify said actual gauge wheel downforce Fa on one of said plurality of row units.</p>",
            "plain": "The method of claim 9 <>, wherein each of said plurality of valves adjusts a pressure in one of a plurality of downforce actuators in order to bring said actual gauge wheel downforce Fa closer to said desired gauge wheel downforce Fd at each row unit, each of said plurality of downforce actuators being disposed to modify said actual gauge wheel downforce Fa on one of said plurality of row units.",
            "claimTree": {
                "parentIds": [
                    "CLM-00009"
                ],
                "parentCount": 1,
                "childIds": [
                    "CLM-00011"
                ],
                "childCount": 1,
                "claimTreelevel": 3
            }
        },
        {
            "id": "CLM-00011",
            "type": "DEPENDENT",
            "raw": "<claim id=\"CLM-00011\" num=\"00011\">\n<claim-text>11. The method of <claim-ref idref=\"CLM-00010\">claim 10</claim-ref>, further including:\n<claim-text>sensing said actual gauge wheel downforce Fa on one of said plurality of row units using a load sensor, said load sensor disposed to measure said actual gauge wheel downforce Fa, said load sensor in electrical communication with a control module, said control module defining said desired gauge wheel downforce Fd.</claim-text>\n</claim-text>\n</claim>",
            "normalized": "<p class=\"claim\" id=\"CLM-00011\" depends=\"CLM-00010\">The method of <a idref=\"CLM-00010\" id=\"CR-0001\" class=\"claim\">claim 10</a>, further including:\nsensing said actual gauge wheel downforce Fa on one of said plurality of row units using a load sensor, said load sensor disposed to measure said actual gauge wheel downforce Fa, said load sensor in electrical communication with a control module, said control module defining said desired gauge wheel downforce Fd.</p>",
            "plain": "The method of claim 10 <>, further including: sensing said actual gauge wheel downforce Fa on one of said plurality of row units using a load sensor, said load sensor disposed to measure said actual gauge wheel downforce Fa, said load sensor in electrical communication with a control module, said control module defining said desired gauge wheel downforce Fd.",
            "claimTree": {
                "parentIds": [
                    "CLM-00010"
                ],
                "parentCount": 1,
                "childIds": [
                    "CLM-00012"
                ],
                "childCount": 1,
                "claimTreelevel": 4
            }
        },
        {
            "id": "CLM-00012",
            "type": "DEPENDENT",
            "raw": "<claim id=\"CLM-00012\" num=\"00012\">\n<claim-text>12. The method of <claim-ref idref=\"CLM-00011\">claim 11</claim-ref>, further including:\n<claim-text>detecting that said planter row unit is in a transport position; and</claim-text>\n<claim-text>upon detecting that said planter row unit is in a transport position, modifying said desired gauge wheel downforce Fd for all of said plurality of row units.</claim-text>\n</claim-text>\n</claim>",
            "normalized": "<p class=\"claim\" id=\"CLM-00012\" depends=\"CLM-00011\">The method of <a idref=\"CLM-00011\" id=\"CR-0001\" class=\"claim\">claim 11</a>, further including:\ndetecting that said planter row unit is in a transport position; and\nupon detecting that said planter row unit is in a transport position, modifying said desired gauge wheel downforce Fd for all of said plurality of row units.</p>",
            "plain": "The method of claim 11 <>, further including: detecting that said planter row unit is in a transport position; and upon detecting that said planter row unit is in a transport position, modifying said desired gauge wheel downforce Fd for all of said plurality of row units.",
            "claimTree": {
                "parentIds": [
                    "CLM-00011"
                ],
                "parentCount": 1,
                "childIds": [
                ],
                "childCount": 0,
                "claimTreelevel": 5
            }
        },
        {
            "id": "CLM-00013",
            "type": "DEPENDENT",
            "raw": "<claim id=\"CLM-00013\" num=\"00013\">\n<claim-text>13. The method of <claim-ref idref=\"CLM-00002\">claim 2</claim-ref>, further including:\n<claim-text>measuring said actual gauge wheel downforce Fa using a load sensor mounted to said planter row unit.</claim-text>\n</claim-text>\n</claim>",
            "normalized": "<p class=\"claim\" id=\"CLM-00013\" depends=\"CLM-00002\">The method of <a idref=\"CLM-00002\" id=\"CR-0001\" class=\"claim\">claim 2</a>, further including:\nmeasuring said actual gauge wheel downforce Fa using a load sensor mounted to said planter row unit.</p>",
            "plain": "The method of claim 2 <>, further including: measuring said actual gauge wheel downforce Fa using a load sensor mounted to said planter row unit.",
            "claimTree": {
                "parentIds": [
                    "CLM-00002"
                ],
                "parentCount": 1,
                "childIds": [
                ],
                "childCount": 0,
                "claimTreelevel": 2
            }
        },
        {
            "id": "CLM-00014",
            "type": "DEPENDENT",
            "raw": "<claim id=\"CLM-00014\" num=\"00014\">\n<claim-text>14. The method of <claim-ref idref=\"CLM-00001\">claim 1</claim-ref>, wherein said first fluid control apparatus comprises a fluid manifold, said fluid manifold having a plurality of fluid inputs and a plurality of fluid outputs.</claim-text>\n</claim>",
            "normalized": "<p class=\"claim\" id=\"CLM-00014\" depends=\"CLM-00001\">The method of <a idref=\"CLM-00001\" id=\"CR-0001\" class=\"claim\">claim 1</a>, wherein said first fluid control apparatus comprises a fluid manifold, said fluid manifold having a plurality of fluid inputs and a plurality of fluid outputs.</p>",
            "plain": "The method of claim 1 <>, wherein said first fluid control apparatus comprises a fluid manifold, said fluid manifold having a plurality of fluid inputs and a plurality of fluid outputs.",
            "claimTree": {
                "parentIds": [
                    "CLM-00001"
                ],
                "parentCount": 1,
                "childIds": [
                ],
                "childCount": 0,
                "claimTreelevel": 1
            }
        },
        {
            "id": "CLM-00015",
            "type": "DEPENDENT",
            "raw": "<claim id=\"CLM-00015\" num=\"00015\">\n<claim-text>15. The method of <claim-ref idref=\"CLM-00001\">claim 1</claim-ref>, further including:\n<claim-text>sending a command signal to a solenoid associated with said first fluid control apparatus, wherein in response to receipt of said command signal, said solenoid causes said fluid control apparatus to modify an operating state of said fluid control apparatus such that said actual gauge wheel downforce Fa becomes closer to said desired gauge wheel downforce Fd.</claim-text>\n</claim-text>\n</claim>",
            "normalized": "<p class=\"claim\" id=\"CLM-00015\" depends=\"CLM-00001\">The method of <a idref=\"CLM-00001\" id=\"CR-0001\" class=\"claim\">claim 1</a>, further including:\nsending a command signal to a solenoid associated with said first fluid control apparatus, wherein in response to receipt of said command signal, said solenoid causes said fluid control apparatus to modify an operating state of said fluid control apparatus such that said actual gauge wheel downforce Fa becomes closer to said desired gauge wheel downforce Fd.</p>",
            "plain": "The method of claim 1 <>, further including: sending a command signal to a solenoid associated with said first fluid control apparatus, wherein in response to receipt of said command signal, said solenoid causes said fluid control apparatus to modify an operating state of said fluid control apparatus such that said actual gauge wheel downforce Fa becomes closer to said desired gauge wheel downforce Fd.",
            "claimTree": {
                "parentIds": [
                    "CLM-00001"
                ],
                "parentCount": 1,
                "childIds": [
                ],
                "childCount": 0,
                "claimTreelevel": 1
            }
        }
    ],
    "citations": [
        {
            "num": "00001",
            "type": "PATENT",
            "citedBy": "PATCIT",
            "examinerCited": true,
            "text": "US6389999B1"
        },
        {
            "num": "00002",
            "type": "PATENT",
            "citedBy": "PATCIT",
            "examinerCited": true,
            "text": "US8634992B2"
        },
        {
            "num": "00003",
            "type": "PATENT",
            "citedBy": "PATCIT",
            "examinerCited": true,
            "text": "US8924102B2"
        },
        {
            "num": "00004",
            "type": "PATENT",
            "citedBy": "PATCIT",
            "examinerCited": true,
            "text": "US2007/0089653A1"
        },
        {
            "num": "00005",
            "type": "PATENT",
            "citedBy": "PATCIT",
            "examinerCited": true,
            "text": "US2012/0048159A1"
        },
        {
            "num": "00006",
            "type": "PATENT",
            "citedBy": "PATCIT",
            "examinerCited": true,
            "text": "US2012/0060730A1"
        }
    ],
    "classification": {
        "ipc": [
            {
                "type": "main",
                "raw": "A01B 63/00",
                "normalized": "A01B 63/00",
                "facets": [
                    "0/A",
                    "1/A/A01",
                    "2/A/A01/A01B",
                    "3/A/A01/A01B/A01B63",
                    "4/A/A01/A01B/A01B63/A01B6300"
                ]
            },
            {
            },
            {
                "type": "main",
                "raw": "A01B 71/02",
                "normalized": "A01B 71/02",
                "facets": [
                    "0/A",
                    "1/A/A01",
                    "2/A/A01/A01B",
                    "3/A/A01/A01B/A01B71",
                    "4/A/A01/A01B/A01B71/A01B7102"
                ]
            },
            {
            },
            {
                "type": "main",
                "raw": "A01C 7/20",
                "normalized": "A01C 7/20",
                "facets": [
                    "0/A",
                    "1/A/A01",
                    "2/A/A01/A01C",
                    "3/A/A01/A01C/A01C7",
                    "4/A/A01/A01C/A01C7/A01C720"
                ]
            },
            {
            }
        ],
        "uspc": [
            {
                "type": "main",
                "raw": "111 59",
                "normalized": "111/059000000",
                "facets": [
                    "1/111/111059000000",
                    "0/111"
                ]
            },
            {
            },
            {
                "type": "main",
                "raw": "111 62",
                "normalized": "111/062000000",
                "facets": [
                    "0/111",
                    "1/111/111062000000"
                ]
            },
            {
            },
            {
                "type": "main",
                "raw": "111134-137",
                "normalized": "111/134000000,135000000,136000000,137000000",
                "facets": [
                    "1/111/111134000000",
                    "0/111",
                    "1/111/111136000000",
                    "1/111/111137000000",
                    "1/111/111135000000"
                ]
            },
            {
            },
            {
                "type": "main",
                "raw": "111135",
                "normalized": "111/135000000",
                "facets": [
                    "0/111",
                    "1/111/111135000000"
                ]
            },
            {
            },
            {
                "type": "main",
                "raw": "111136",
                "normalized": "111/136000000",
                "facets": [
                    "0/111",
                    "1/111/111136000000"
                ]
            },
            {
            },
            {
                "type": "main",
                "raw": "111149",
                "normalized": "111/149000000",
                "facets": [
                    "0/111",
                    "1/111/111149000000"
                ]
            },
            {
            },
            {
                "type": "main",
                "raw": "111163",
                "normalized": "111/163000000",
                "facets": [
                    "1/111/111163000000",
                    "0/111"
                ]
            },
            {
            },
            {
                "type": "main",
                "raw": "111190-196",
                "normalized": "111/190000000,191000000,192000000,193000000,194000000,195000000,196000000",
                "facets": [
                    "1/111/111192000000",
                    "1/111/111195000000",
                    "1/111/111194000000",
                    "1/111/111196000000",
                    "0/111",
                    "1/111/111190000000",
                    "1/111/111191000000",
                    "1/111/111193000000"
                ]
            },
            {
            },
            {
                "type": "main",
                "raw": "111200",
                "normalized": "111/200000000",
                "facets": [
                    "0/111",
                    "1/111/111200000000"
                ]
            },
            {
            },
            {
                "type": "main",
                "raw": "172  1",
                "normalized": "172/001000000",
                "facets": [
                    "0/172",
                    "1/172/172001000000"
                ]
            },
            {
            },
            {
                "type": "main",
                "raw": "172  2",
                "normalized": "172/002000000",
                "facets": [
                    "0/172",
                    "1/172/172002000000"
                ]
            },
            {
            },
            {
                "type": "main",
                "raw": "172  4- 12",
                "normalized": "172/004000000,005000000,006000000,007000000,008000000,009000000,010000000,011000000,012000000",
                "facets": [
                    "1/172/172007000000",
                    "1/172/172004000000",
                    "1/172/172009000000",
                    "0/172",
                    "1/172/172010000000",
                    "1/172/172012000000",
                    "1/172/172005000000",
                    "1/172/172006000000",
                    "1/172/172011000000",
                    "1/172/172008000000"
                ]
            },
            {
            },
            {
                "type": "main",
                "raw": "701 50",
                "normalized": "701/050000000",
                "facets": [
                    "0/701",
                    "1/701/701050000000"
                ]
            },
            {
            }
        ],
        "cpc": [
            {
                "type": "main",
                "raw": "A01B 63/008",
                "normalized": "A01B 63/008",
                "facets": [
                    "0/A",
                    "1/A/A01",
                    "2/A/A01/A01B",
                    "3/A/A01/A01B/A01B63",
                    "4/A/A01/A01B/A01B63/A01B63008"
                ]
            },
            {
            },
            {
                "type": "main",
                "raw": "A01B 71/02",
                "normalized": "A01B 71/02",
                "facets": [
                    "0/A",
                    "1/A/A01",
                    "2/A/A01/A01B",
                    "3/A/A01/A01B/A01B71",
                    "4/A/A01/A01B/A01B71/A01B7102"
                ]
            },
            {
            }
        ]
    }
}